label start:

    # Пролог: Воспоминания о грядущем - Мимолётный сон. | Prologue: Memories of the Future - A Fleeting Dream.

    scene bg_prologue_ru
    with averagedissolve
    $ renpy.pause(3.0)
    scene bg_nothing
    with averagedissolve
    play music deepspace fadeout 0.7
    v "Я помню день, когда изменилось всё."
    v "Тогда я стоял на холме..."
    v "В последний раз я видел мир таким, каким я его помнил."

    v "Я пытался впитать в себя каждое мгновение."
    v "Ведь я знал, что..."
    v "время моей жизни стремительно близилось к нулю."

    v "День, принёсший миру великое бедствие."
    v "Чтобы мы ни делали, оно рано или поздно наступило бы."
    v "Даже если бы все встали на колени и молили о спасении..."
    v "Не было бы никого, кто смог спасти нас."

    v "\"Ничто мне не поможет.\" "
    v "\"Никто меня не спасет.\" "

    v "Большая тень накрыла знакомый город."
    v "Грохот раскалял уши,"
    v "когда миллионы голосов вспыхнули в агонии,"
    v "и внезапно утихли..."

# Пролог: Мимолётный сон - Ночь. Моя комната. | Prologue: Fleeting Dream - Night. My room.

    "..."
    "..."
    ".?."
    "Я проснулся в кромешной тьме, ощущая холод по всему телу."
    me " \"Этой ночью мне снова плохо спится...\" "
    "Но, по кое-какой причине, я уже привык к этому."
    "А дело в том, что у меня вошло в привычку ворочаться во сне."
    "Невольно скидывая с себя одеяло, я обречен замёрзнуть, особенно в это время года."
    "Возможно, как раз из-за этого я постоянно вижу неприятные сны."
    "Правда, этому также способствует очередной сквозняк, проникающий через щели в моём пластиковом окне..."
    me " \"А осень, как всегда, всё также любит мне насолить...\" "
    "Я никогда не любил холод."
    "Какой бы красивой и тихой не была осень у меня в деревеньке, я никогда не смогу привыкнуть к ней."
    "Зачем мне любить то, из-за чего я постоянно чувствую {w=0.5}дискомфорт?"
    "..."
    me " \"Эх...\" "
    "Сладко зевнув, я потянулся."
    "Было давно заполночь."
    "Я знал это, но спать дальше не собирался."
    "Даже если придется себя заставить..."
    "Мои глаза уже стали привыкать к темноте, и я начал замечать очертания объектов моей комнаты."
    "Сел, завернулся поудобнее в одеяло, положил тяжелую голову на плечо и обпер её рукой..."
    "Ещё немного подожду..."
    stop music fadeout 4
    "..."
    "..."
    "Через несколько минут я уже не чувствовал себя сонным."
    "Когда холодный воздух чуть взбодрил мой мозг,"
    "Я поднялся и обвел взглядом свою комнату..."
    scene bg_night_room_light_off_1 with slowdissolve
    "..."
    "Сколько я себя помню, здесь мало что изменилось."
    "Моя комната, наверное, ничем особым не выделялась среди подобных у моих сверстников, но была достаточно просторной."
    "В последнее время число моих увлечений сильно уменьшилось, из-за чего я просто решил избавиться от лишних вещей."
    "А то, что было жалко выбрасывать, я просто сложил в коробки, большая часть которых уже пылилась на чердаке."
    "Книги и остальные вещи распололижись на полках."
    "А всё, что рано или поздно могло мне пригодиться, я оставил у себя под рукой - в ящичке письменного стола."
    "..."
    "Недавно я обнаружил, что, в отличие от большинства парней моего возраста, я более склонен к чистоте."
    "И в дни, когда подолгу приходится сидеть дома, даже мне заметно, как я стал чаще убираться..."
    "..."
    "Я медленно пошел в сторону двери."
    "Нащупал выключатель."
    "Клац.."
    scene bg_night_room_light_on
    with superfastdissolve
    "И яркий свет залил мои глаза..."
    "Через пару секунд ко мне вернулось нормальное зрение, которое я сам же подвергнул \"неприятности\", включив свет посреди ночи."
    "Не успели  зрачки привыкнуть к свету, как я сразу посмотрел на мирно тикающие часы, что висели над дверью."
    me " \"Почти пол шестого?!\" "
    "Для нормальных людей это время было ещё глубокой ночью, но для меня, живущего в уголке вселенной, это означало, что я мог опоздать на работу!"
    me " \"Как так получилось, что я позволил себе просидеть в полудрёме больше, чем следовало бы...\" "
    me " \"Неужели я опять опоздаю?\" "
    "Очередной укор..."
    "В последнее время жизнь идет совсем не так, как мне хотелось бы."
    "И в очередной раз ничем, кроме самокритики, которая порой доходит до самоуничижения, я наградить себя не могу..."
    "Я поспешил в ванную."

    # Пролог: Ванная. | Prologue: Bathroom.
    scene bg_bathroom_1
    with slowdissolve
    pause 0.5
    play music solace fadeout 2
    "Фух..."
    "..."
    "Я не стал принимать душ."
    "Хотя я обычно люблю полежать в ванной, и дать моим мышцам насладиться тёплой водой."
    "(которых, собственно, толком у меня никогда не было)"
    "Пока я умывался и чистил зубы, в моей голове начали крутиться мысли насчёт сегодняшнего распорядка дня."
    "..."

    # Пролог: гостиная. | Prologue: living room.
    scene bg_nothing
    with slowdissolve
    "Я вышел из ванной, что была напротив моей комнаты,"
    "спустился на первый этаж дома"
    "и поторопился в гостиную."
    scene bg_living_room_1
    with slowdissolve
    pause 0.5
    "..."
    "Здесь было также тихо, как и на втором этаже."
    "Но так было не всегда."
    "..."
    "Так как я всё же привык жить в полумраке, я решил не включать свет."
    "Несмотря на то, что скоро конец ноября, свет первых лучей солнца уже пробивался сквозь окна."
    "Как-то раз я слышал интервью одной бабушки, которая говорила, что раньше солнце восходило гораздо позже."
    "Но я не придал этому значения, ведь все знают, что подобные вещи могу меняться спустя какое-то время."
    "Я не был уверен, что это хорошо."
    "Но ничего плохого в этом не видел."
    "К тому же, я сомневаюсь, что жизнь на планете как-то сильно изменилась."
    "Пустые беспокойства мне ни к чему..."
    "..."
    "Я быстро поставил чайник, открыл холодильник, и начал делать себе завтрак."
    "Уже собирался снова проверить время, но прежде, чем я взглянул на настенные часы, я вспомнил, что они давно не работают."
    "Нужно было поменять батарейки, но..."
    "Во-первых, я редко когда задерживаюсь в этой комнате."
    "Во-вторых, мое нежелание что-либо менять в гостиной связано со старыми воспоминаниями."
    "И лишний раз ворошить их мне бы не хотелось."
    "..."
    "Закончив с бутербродами, я поместил их в сэндвичницу."
    "Это такое небольшое устройство, которое просто прожарит хлеб со всем, что я туда положил."
    "Пока я готовил, закипел чайник."
    "Я достал из шкафчика коробку с заваркой чёрного чая."
    "Залил кипятком часть заварки."
    me " \"Эх, и чай скоро кончится. Надо будет сходить в магазин\". "
    "И вправду."
    "Я давно не ходил по магазинам."
    "Сейчас в моей жизни нет ничего, кроме цикла \"работа - дом\". "
    "Так как вставать приходится рано,"
    "а возвращаться домой - поздно,"
    "у меня даже нет времени придумать себе какое-то хобби."
    "Как бы я не желал вернуться в далекие дни моего детства..."
    "Взрослая жизнь постоянно даёт о себе знать."
    "Может, в душе я всё еще ребенок."
    "Вернее, хочу им быть."
    "Но никто в современном обществе, спрашивать не будет, чего ты хочешь..."
    "От меня будут требовать только принципиального следования законов взрослой жизни."
    "И не стоило надеяться, что когда я съеду от родителей, моя жизнь станет лучше."
    me " \"Пффф...\" "
    "Я слегка подавился чаем от своих мыслей."
    "Когда я жил у родителей, мне всегда казалось, что я - комнатный цветочек, который только тронь  - и он завянет."
    "Поэтому, когда мне исполнилось 20 лет, я твердо решил:"
    "переехать."
    "И чем скорее - тем лучше."
    "Но тогда я еще не знал, с какими трудностями мне придётся столкнуться."
    "..."
    "Доев свой скромный завтрак, состоящий из чая и прожаренных бутербродов с сыром и колбасой,"
    "я решил вернуться в свою комнату."

    # Пролог: моя комната - Утро. | Prologue: my room - Morning.
    scene bg_room_dawn_2_light_off
    with slowdissolve
    pause 1.0
    "Когда я взглянул на часы в своей комнате, было почти шесть."
    "Уже светало."
    "Я одевался."
    "Черные плотные брюки..."
    "Белая рубашка,"
    "Серый галстук."
    "Ещё со времен школы мне нравилась подобная одежда."
    "Возможно, я просто привык к ней и не могу представить себя в чём-то другом."
    "..."
    "Я закинул рюкзак себе на спину."
    "Я всегда беру его собой, чтобы не нести нужные мне вещи в кармане."
    "Однако в последнее время мне в принципе мало приходилось что-либо носить..."
    "Сейчас в портфеле лежали некоторые документы с работы, несколько банковских карт и карта-ключ от дома..."
    "Раньше у меня был и телефон, но он давно изжил себя."
    "Я накинул на себя герметическую куртку, лёгкую, как ветровку, но достаточно тёплую, чтобы согреть меня в это время года."
    "И спустился по ступенькам вниз."
    stop music fadeout 3

    # Пролог: моя комната - Утро. | Prologue: my room - Morning.
    scene bg_my_hall_dawn
    with slowdissolve
    pause 1.0
    "И вот я уже стою в холле..."
    "За моей спиной - гостиная, которую я только что покинул."
    "На часах начало седьмого."
    "Дверь возле меня  - кладовка."
    "Если по коридору завернуть направо, то можно выйти в сад."
    "Слева распологается уборная."
    "..."
    "Но я направился прямо к двери, что выведет меня в мир."
    "Мир, где я не увижу ничего нового."

    # Пролог: Утро - Улицы. | Prologue: Morning - Streets.
    scene bg_sky_dawn
    with slowdissolve
    pause 0.7
    play music november fadeout 2
    "К тому времени, когда я вышел на улицу, светлее не стало."
    "Набежавшие тучи заслонили утренний свет."
    "От дома я свернул налево и прошёл несколько жилых кварталов."
    scene bg_street_dawn
    with slowdissolve
    pause 0.7
    "Вскоре я вышел на небольшой перекрёсток."
    "На небе кое - где еще виднелись звёзды..."
    "..."
    "Я продолжал идти по тротуару."
    "Город спал."
    "Лишь изредка я мог услышать голоса сонных людей, спешивших на работу,"
    "а также шум колёс машин, проезжающих по соседним улицам."
    "..."
    "Пройдя несколько похожих друг на друга улиц, я свернул в следующий спальный район."
    scene bg_street_1_dawn
    with slowdissolve
    pause 1
    "..."
    scene bg_street_2_dawn
    with slowdissolve
    pause 1
    "Оставив позади одну улицу, я свернул налево."
    "Спустя ещё два квартала, я добрался до центральной улицы города."
    "Вообще, как я недавно выяснил, даже без знания основных маршрутов и местности, по этой дороге можно было попасть куда угодно."
    "Такое возможно только благодаря её удобному расположению."
    "А лично мне нужно как можно скорее попасть на станцию..."
    "По моим догадкам, времени на то, чтобы добраться от моего дома к электричке по самому короткому пути, используя центральную улицу, необходимо около тридцати минут."
    "Но я никак не мог отделаться от мысли, что я уже иду дольше предполагаемого времени."
    "Я ускорился, чуть ли не начав бежать."
    "..."
    "Вообще, я мог бы словить автобус."
    "Или вызвать такси."
    "Но так уж вышло, что я любил ходить до станции пешком."
    "Осталось пройти один перекресток по основной улице, а затем свернуть в парк."
    "Возможно, у меня есть меньше времени, чем я думал."
    me " \"Да, трудно жить без часов под рукой...\" "
    me " \" От своей перманетной лени и некомпетентности в некоторых вещах, иногда даже я устаю.\""
    "..."
    "Пока я двигался к намеченной цели, мысли снова заняли мою голову."
    "Я стал вспоминать как и события недавних дней, так и многих лет назад."
    "Как год назад, я, разочаровав родителей, решил переехать к дяде и тетё в деревенскую глубинку."
    "Хотя место, в котором я живу, трудно сейчас назвать деревней, ибо многое здесь изменилось с тех пор, как я был ещё мал..."
    "Но по сравнению с тем местом, куда я собираюсь ехать..."
    me " \"Я определённо живу в деревне...\" "
    "Умудрился я на бегу ухмыльнуться."
    "Центральная улица была довольно широкой и длинной."
    "Мне нужно было ещё немного попотеть, чтобы добраться до намеченного перекрёстка."
    scene bg_street_3_dawn
    with slowdissolve
    pause 1
    "..."
    "Мои родители были всегда строги ко мне."
    "Но также часто давали мне поблажки."
    "Возможно, начав новую жизнь, я изменю прежнего себя."
    "И не буду позором в их глазах."
    "Мне требовалось лишь немного усилий, чтобы убедить их отпустить меня."
    "Я пообещал им, что буду учиться и ездить в университет отсюда."
    "И не то, чтобы я обманул их..."
    "Я просто нашел работу, поэтому перевёлся на заочное."
    "..."
    "Сколько себя помню, моих родителей всегда интересовало только финансовое состояние семьи."
    "Они были профессионалами своего дела."
    "Постоянно занимались разного рода бизнесом, но меня всегда поражало, что денег это приносило достаточно."
    "По крайней мере, я не мог отказать себе во многих вещах."
    "Папа и мама не были плохими. Как и все родители, они просто пытались научить меня тому, что и сами знают."
    "Но мне этого никогда не хотелось. Я считал, что там, где деньги, недалеко обман, махинации, а возможно, и криминал."
    "Я решил отдалиться от этого."
    "Поэтому я сам выбрал университет. Я решил, по крайней мере, прикрыться тем, что учусь делу, чтобы меня больше не донимали."
    "Но потом, я бросил и учебу."
    "Я понял, что стал заниматься тем, что не приносит мне счастья."
    "В итоге, я закрылся от всего..."
    "Возможно сейчас, в очередной раз опаздывая на работу, я жалею о том, что не прислушался к их советам."
    "Я думал, что сам смогу без проблем зарабатывать на жизнь, однако сейчас у меня мало денег."
    "Мне нечему гордиться и радоваться."
    "А мои детские дни, когда я беззаботно играл с дядей и тётой, давно позади..."
    scene bg_park_dawn
    with slowdissolve
    pause 0.8
    "Фух..."
    "Запыхавшись, я добежал до парка."
    "Я остановился передохнуть, а затем зашагал в сторону станции."
    "От парка до неё - рукой подать."
    "Электричка приедет ровно в 6:45."
    "Я уверен, что успеваю."
    "Поезда в центр ходят круглосуточно, но с разным интервалом."
    "Например, предыдущий рейс, отбывает с этой станции ровно в 5:30."
    "Если бы я потрудился встать в пол пятого утра, то приехал бы на работу не только вовремя, а ещё и с большим запасом."
    "Тогда я бы произвел впечатление хорошего работника, а некоторые личности перестали бы на меня косо смотреть..."
    "Мало того, я бы мог спокойно приготовить всё, что нужно для рабочего процесса, уже в офисе, просто попросив разрешения у работодателя."
    "..."
    "Вскоре я взошёл на платформу."
    scene bg_station
    with slowdissolve
    pause 0.4
    "!"
    "Поезд уже был на станции!"
    "И судя по тому, что я вижу, он вот-вот начнёт движение."
    "Я кинулся в ближайший вагон."
    scene bg_station
    with slowdissolve
    pause 0.5
    stop music fadeout 3
    # Пролог: Утро - Поездка в город. | Prologue: Morning - The way to city.
    scene bg_train_hall
    with slowdissolve
    pause 0.5
    "..."
    "Прошло больше получаса с момента моей посадки."
    "Ранее, когда я вошел в вагон поезда, оказавшегося, на удивление, пустым, я взглянул на дисплей, где показывалось текущее время."
    "Часы показали 6:46, и поезд тут же тронулся."
    "..."
    "Я всё же успел."
    "Но мысль о том, что я мог не успеть из-за каких-то тридцати секунд, мне явно не нравилась."
    "Однако сейчас меня это почти не волновало."
    "Поезд давно уехал из знакомых мне мест."
    "В вагоне, в котором я сидел, так никто больше и не появился.."
    me " \"Опять еду в полном одиночестве...\" "
    "Сейчас тем, чем можно было любоваться из окна, были лишь бескрайние поля и редко встречающиеся леса."
    "Моя деревня была последней остановкой перед конечной - мегаполисом юга, с названием FYTLu#324."
    "Больше остановок на пути не будет..."
    "Именно туда мне приходится ездить на работу 5 раз в неделю."
    "Путь от моего дома к этим \"бетонным джунглям\" меряется не одной сотней километров."
    "Возможно, сто лет назад людям такие расстояния показались бы довольно большими, учитывая, что для их преодоления используется обычная электричка."
    "Но для теперешнего общества всё по-другому."
    "Может поезд, в котором я еду, внешне не выглядит как-то особенно..."
    "Однако он в состоянии поддерживать среднюю скорость, близкую к 400 км/ч."
    "И это далеко не предел."
    "Модель загородних электричек - LDET-334 - что совсем недавно начала выпускаться Межрегиональной Транспортной Организацией,
    непосредственно подчинённой Верховному Управлению CCv03,"
    "уже зарекомендовала себя как \"надежный и проверенный транспорт\"."
    "Первые тесты показывали, что новая модель способна разогнаться до 800 км/ч."
    "Недавно Правительство (Верховный Комитет), в целях безопасности, запретило перевозить на таких высоких скоростях, как и грузы, так и пассажиров."
    "Поэтому большинство рейсов теперь используют свою среднюю скорость движения..."
    "Вообще, система сверхпроводящих магнитов, установленная на железнодорожных путях, с помощью которой поезда в процессе движения не касаются поверхности рельс,"
    "была придумана очень давно."
    "Но лишь тридцать лет назад она достаточно развилась для того, чтобы её начали внедрять повсюду."
    "И достигла необходимой экономическо-выгодной фазы."
    "..."
    "А важно то, что практически все, живущие на обочине вселенной, теперь могут спокойно добираться туда, куда пожелают..."
    "И с достойным комфортом."
    "Все более-менее современные поезда движутся бесшумно и без намеков на покачивание."
    "В среднем, электричке требуется от двух с половиной до трёх с лишним часов времени, чтобы добраться до необходимого мне места назначения."
    "..."
    "Помимо LDET-334, есть ещё более продвинутые виды поездов, но это нужно уже смотреть на рейсы МежМегаполисного масштаба."
    "И конечно же, скорость перевозки там значительно выше, особенно в моделях VIP класса."
    "..."
    "Будущее..."
    "Каким его представляли люди много лет назад?"
    "Если бы ..."
    "нашелся такой человек, который его ещё не видел,"
    "чтобы он захотел нам сказать?.."
    "Лично для меня..."
    "Будущее давно наступило,"
    "но и близко не было таким, каким я его себе представлял."
    "Говоря про будущее - многое изменилось в этом мире,"
    "но было и чувство, будто всё откатилось назад."
    "..."
    "Да и что такое \"будущее\"?"
    "Мы не можем увидеть или почувствовать его."
    "Иногда мы можем его просчитать или предугадать."
    "Но всё равно будущее будет иллюзией, пока мы не осознаем, что оно стало настоящим..."
    "..."
    "..."
    "Каждый раз, когда я еду в FYTLu#324,"
    "я, прислоняя голову к окну, задумываюсь о событиях прошедших десятилетий..."
    scene bg_nothing
    with slowdissolve
    pause 0.5
    play music whales fadeout 3
    "..."
    "Больше нескольких веков назад во время мирового энергокризиса,"
    "когда казалось, что выхода из положения нет,"
    "учёные передовых стран нашли новый элемент глубоко в недрах земли."
    "Ранее неиследованный, поначалу он представлял из себя большую загадку."
    "Было много споров на тему его происхождения, а также событий, приведших его появлению на планете."
    "В итоге, большинтсво придержалось мнения, что элемент инопланетный."
    "В ходе исследования обнаружилось, что он, помещенный в специально созданную искусственую среду,"
    "способен выделять колоссальное количество энергии при минимальных затратах."
    "Элемент получил кодовое название XiJ. Была создана одноименная организация, целью которой было перестроить всю энергосистему мира."
    "Работа кипела, но очень нескоро был придуман способ его добычи, ведь тот обладал и множеством других скрытых свойств."
    "Но мир не мог ждать."
    "Началась новая война."
    scene bg_burned_city
    with slowdissolve
    pause 0.7
    "Она была не такой, как предполагали многие."
    "Война не уничтожила человечество, но имела серьёзные последствия."
    "Бессчисленное количество людей погибло, многие мелкие страны были стёрты с лица земли."
    "Дошло даже до сброса нескольких атомных бомб."
    "Под конец войны, когда пол планеты лежало в руинах, явились Они.."
    "Те, кто столетиями дёргали за ниточки."
    "Те, кто управлял ходом истории."
    "Об их существовании давно догадывались."
    "И называли их по-разному."
    "Но тогда уже было не важно, кто они."
    "Разорённый войной мир жаждал перерождения."
    "А они могли его дать."
    "Даже если бы им кто-нибудь помешал, они бы всё равно пришли к власти."
    "Ведь за ними стояли ещё сотни таких же, как они..."
    "Та элита, что тайно управляла миром, с того момента стала называть себя \"CC\" или \"Командный центр\"."
    "И только благодаря им, мир начал свой путь к восстановлению."
    "..."
    # scene bg_constructions
    # with slowdissolve
    # pause 0.5
    # "Шло время..."
    # "Огромные финансовые сбережения и сохранившаяся техника CC, а также множество хорошо обученных специалистов,
    # в ряды которых уже вошёл персонал организации XiJ, позволили быстро отстроить города и наладить производство."
    # "Благодаря продолжительному исследованию нового элемента, инженерам и ученым наконец-то удалось применить его в деле."
    # "Отчасти обуздав новый элемент, исследователи начали разрабатывать новые необходимые технологии..."
    # "Первыми устройствами были специальные аккумуляторы, способные хранить выделяемую энергию XiJ."
    # "Стартовали разработки внедрения полученных результатов в сферу транспорта, а также автоматизации всего, чего только возможно."
    # "Энергия XiJ, даже при малых её количествах, была гораздо эффективнее всех других известных источников."
    # "Там, куда внедряли новые разработки, КПД рос на глазах."
    # "Двигатели на новой энергии стали успешно применяться, в первую очередь, на железных дорогах."
    # "Ибо из элемента XiJ было проще всего синтезировать что-то наподобие электричества..."
    # "Постепенно, новый элемент начал вытеснять остальные источники энергии."
    # "Он не смог заменить их полностью, но, наверное, уже восемьдесят процентов современной техники, используют энергию, синтезированную на XiJ."
    # "Сейчас ведутся разработки внедрения новых двигателей в автотранспорт, морские суда, а также в технику, связанной с воздушным пространством и космосом."
    # "Пока что, особого успеха в этом деле организация CC не достигла из-за недостатка финансов, поэтому проекты временно переведены в стазисный режим."
    # "..."
    # scene bg_nothing
    # with slowdissolve
    # pause 0.5
    # "Возвращаясь к прошлому..."
    # "Влияние и авторитет CC стали всемирно неоспоримы, и дело дошло до переговоров - "
    # "когда оставшиеся после войны крупные страны решали вопросы политики."
    # "Так как CC внесла огромный вклад в восстановление мира, она могла диктовать свои условия."
    # "Условия Организации оказались ошеломительными, хотя сейчас, все стали понимать, что тогдашнее решение CC, возможно, было правильным."
    # "CC предложило упразднить системы государств, народностей, и всего, что могло сильно разъединить людей."
    # "Взамен этому будет создана единая структура под названием \"Сеть\"."
    # "Этот единый огранизм, по мнению Организации, мог бы расти и развиваться под их присмотром до тех пор, пока это было нужно..."
    # "Лидеры присоединившихся к \"Сети\" стран получили бы высокие должности на руководящих постах..."
    # "Выбора не было."
    # "Точнее был, но и без намёков было понятно, что тех, кто отвергнет предложение СС, ждало бы исчезновение."
    # "Оставшиеся ресурсы мира были в руках у этой организации, в то время как остальные страны, еле-еле пережив войну,"
    # "не имели шансов на дальнейшее самостоятельное существование..."
    # "Те, кто стал частью \"Сети\", выжили."
    # "CC безжалостно отнеслась к тем, кто отверг её предложение, и оставила их на произвол судьбы."
    # "Однако она поощряла своих новых союзников, языки крупных мировых стран стали государственными языками Системы Нового Порядка."
    # "Но понятие \"народностей\" исчезло, ибо теперь все вступившие были под контролем Организации."
    # "Наконец люди получили спокойствие, и смогли продолжать восстановление мира."
    # "Теперь слово \"Мир\" являлось синонимом слову \"Сеть\", ибо теперь все жили под надзором СС."
    # "Но, ожидаемая многими, тирания со стороны новых лидеров так и не появилась."
    # "И не возникало никаких больших конфликтов."
    # "Правительство поощряло создание мелкого бизнеса и предпринимательства."
    # "Защищая интересы пролетариата, оно не позволяло создавать корпорации и монополии."
    # "А в том случае, когда это происходило, занималось децентрализацией и разделением на мелкие структуры."
    # "Никто не был исключением, даже сами государственные органы."
    # "Количество скептиков уменьшалось пропорционально тому, как рос уровень жизни."
    # "Так как от войны пострадала далеко не вся планета, сохранилось множество пригодных для жизни мест."
    # "Большинство из этих мест, как оказалось, вообще не затронуло пламя войны."
    # "Об энергокризисе все стали потихоньку забывать."
    # "Сеть работала, по мнению СС, \"должным образом\"."
    # "Само устройство новой жизни напоминало то, как работают компьютеры в одной среде."
    # "Узлами Сети выступали большие города, которые имели собственные кодовые названия."
    # "Первым жителям эти названия казались бессмысленными, но СС твёрдо продолжал стоять на своём."
    # "\"Мы строим Новый Мир, поэтому мы должны отказаться от старых имён.\" "
    # "Это было одно из первых провозглашений СС."
    # "Поэтому СС стали называть вещи так, как им было угодно."
    # "Через несколько поколений все смирились, а современной молодёжи, как, впрочем, и мне, было абсолютно всё равно..."
    # "Узлы сети представляли из себя окружности. Центром круга был сам Узел, близлежащие к нему земли делились на сектора и малые сектора."
    # "Моя деревня как раз распологается в одном из таких."
    # "..."
    # scene bg_random_city
    # with slowdissolve
    # pause 0.5
    # "Территориально Узлы были гигантскими, ведь кроме мегаполиса и окружающих его земель, большинство из которых даже не были заселены,"
    # "были ещё административные центры, которые так и назывались - \"Командные Центры\"."
    # "В этих местах агенты Организации контролируют деятельность Узлов."
    # "Командные Центры распологаются в середине каждого Узла и носят его имя."
    # "Например, Командный Центр мегаполиса, в который я еду, называется \"CC - FYTLu#324\"."
    # "..."
    # "На данный момент, всего построено 5 Узлов Межпланетной Сети."
    # "Я живу в секторе самого южного из них."
    # "Между собой узлы соеденены физическими каналами."
    # "Канал - это целый комплекс связи, а также того, что может потребоваться при взаимодействии Узлов."
    # "Рядом с каждым каналом проходит массивная железная дорога, что, по сути, является единственным и самым эффективным способом передвижения вне Узлов,"
    # "учитывая тщательность построения укреплённых станций, путей, тоннелей и мостов."
    # "И также это единственный способ попасть из дальних уголков Узла в его центр..."
    # "Есть объекты, которые считаются вспомогательными частями Сети."
    # "Они не обязательны для её основной работы, но могут иметь важное значение."
    # "Например, шахты добычи XiJ или некоторые контрольные форпосты CC."
    # "Технология добычи необходимого элемента XiJ очень сложна, и до сих пор учёные ищут более эффективный способ его извлечения из глубоких недр..."
    # "Первого обнаруженного на планете в послевоенное время XiJ хватало на очень долгое время, но даже этот ресурс может исчерпать себя."
    # "Когда нашлись новые источники этого элемента, были немедленно выделены ресурсы для постройки шахт, глубина которых могла достигать сотни километров."
    # "Так как ранее человечество не знало, что это за элемент и как его добывать, СС до сих пор не может организовать стабильную добычу."
    # "Но, по прогнозам аналитиков, уже добытого XiJ ещё хватит, по меньшей мере, на пару сотен лет."
    # "Трудность добывания этого элемента заканчивается не только проблемой бурения планеты,"
    # "а также того, что элемент не полностью изучен, отчего есть риск получить непредвиденного рода аномалии, если добывать его в чистом виде..."
    # "Также, последствия добычи очень сильно портят окружающую среду, и неудивительно, что местность вокруг шахт выглядит как бесплодная пустыня..."
    # "Поэтому все Узлы Сети расположены далеко от мест добычи."
    # "И открывать новые шахты на территории жилых Узлов строго запрещено."
    # "..."
    # "Когда Организация CC придумала Сеть, она создала высший орган власти, который назвали Верховный Комитет."
    # "К тому времени, старые управляющие организации ушли в отставку, оставив на своём месте новую перспективную элиту,"
    # "что справилась бы со своими обязанностями не хуже предшественников."
    # "Первые управляющие, что после войны принялись ставить мир на ноги, именовались просто СС или ССv00."
    # "Следующее поколение стало называться \"Верховный Комитет CCv01...\" "
    # "..."
    # "Сейчас уже третье поколение элиты руководит Сетью."
    # "Планы и политика Организации, несмотря на очередную смену поколений, практически не поменялись."
    # "Единтвенной целью комитета ССv03, судя по тому, что они официально заявили, является благоустройство новой системы."
    # "Все предшествующие лидеры также придерживались этого плана и укрепляли свою власть."
    # "Почему-то сейчас политика консерватизма работает как нельзя лучше, но если что-то пойдёт не так,"
    # "то Организация моментально отреагирует и сменит стратегию."
    # "Вот уже 5 лет действует комитет CCv03, и в целом, как говорят, жизнь людей внутри созданной \"Сети\" протекает также тихо и мирно, как это было раньше..."
    # "Сейчас две важнейшие структуры, такие как исследовательская организация \"XiJ\" и Центральный Орден Безопасности(COS),"
    # "которые действуют от лица CC, имеют множество дочерних компаний, и, таким образом, осуществляют контроль"
    # "практически всего, что происходит внутри Сети."
    stop music fadeout 3
    "..."
    scene bg_nothing
    with slowdissolve
    pause 0.5
    "Я повесил голову, уставился в пол вагона и закрыл глаза."
    play music november fadeout 3
    "Через какое-то время, я услышал знакомый голос утреннего ведущего новостей МежСетевого телевидения."
    "Сколько я себя помню,  этот человек всегда был одет в офисную форму, лица его было не разглядеть, так как оно всегда было размыто."
    "Я вскинул голову, посмотрел на дисплей в конце вагона..."
    me "\"Кажется, ничего нового...\""
    "Яркая надпись над дисплеем показывала текущее время - \"08:01\""
    "И, ровно по расписанию, на самом дисплее была изображена в точности персона, которую я описал ранее."
    "Казалось бы, что информация, полученная от такой сомнительной личности, не должна внушать доверия."
    "Но, судя по известному мне настроению общественности, к такой странной политике СС уже давно привыкли."
    "Поэтому, большинство спокойно воспринимает всё, что даст им руководство Сети..."
    "А самый интересный факт из всего этого - никому пока не удалось адекватно подвергнуть сомнению слова СС."
    "Лично меня мало когда интересовали новости социума."
    "Сколько бы я их не слушал, я не мог найти полезную для себя информацию."
    "Вся эта болтовня о политике, общественном порядке и т.д. никак не влияла на мою скромную жизнь, а значит,"
    "подобного рода информация была для меня бесполезной..."
    "Порой я даже удивляюсь, как я могу так спокойно жить на отшибе общества."
    "Всё бы так и продолжалось, не будь у меня доступа к unet (искуственный потомок интернета, созданный и распространенный Организацией всем жителям Сети)."
    "Где я могу проводить часами, читая только интересующую меня информацию..."
    "Фактически, СС контролирует весь юнет, но не вмешивается в дела обычных людей, пока те не придумают чего-нибудь противозаконного."
    "\"Тише воды, ниже травы\" - вот таким правилом нужно руководствоваться, чтобы не навлечь на себя лишние подозрения..."
    "Впрочем, я думаю, в этом плане мало что поменялось с тем, что было до войны, ведь люди не сильно изменились."
    "Но тот же даркнет никто не отменял."
    "Тем не менее, имея настолько хорошо организованную и функционирующую систему, как \"Сеть\", СС даже научились предотвращять преступления,"
    "и с легкостью разбираться с правонарушителями."
    "Больших успехов в этом направлении ещё не было, но руководство сделает всё, чтобы облегчить своё бремя управления..."
    "..."
    "Возвращаясь к прошлой теме..."
    "Не так давно всплыла новость, равнодушной к которой я остаться не мог..."
    "Несколько лет назад, во всех источниках СС была опубликована информация о том, что из глубин космоса приближаются невиданные доселе кометы."
    "Как заверяют исследовательские организации, целый кластер этих комет пройдёт на близком расстоянии от планеты, отчего можно будет наблюдать их феномальный пролёт невооруженным глазом."
    "К тому же, новостей по этой теме не было уже давно."
    "Сейчас телеведущий рассказывал как раз об этом."
    sp "Сегодня поступило официальное подтверждение на разглашение информации от компании XiJ, и было объявлено о том, что подготовка к невиданному событию идёт полным ходом."
    sp "По самым последним прогнозам, кластер комет под временным названием PYU-336 приблизится к планете всего через несколько месяцев."
    sp "Исследователи до сих пор пытаются понять уникальную природу этого движущегося скопления и продолжают с интересом наблюдать за происходящим."
    sp "По их словам, возможность наблюдения подобного события возникает по меньшей мере раз в тысячу лет."
    sp "Также было упомянуто, что, вероятно, давным-давно нечто похожее могло наблюдаться, но не было зафиксировано ни одного случая."
    sp "Они утверждают, что каждая из представленных комет в кластере имеет уникальную структуру, и это обусловлено тем, что каждая из них состоит из доселе неизвестного элемента."
    sp "Известно только то, что этот элемент в составе структур меняет магнитные свойства и гравитационные силы носителя."
    sp "А по следу, оставленному в пространстве, было обнаружено, что это скопление комет путешествует по галактике более тысячи световых лет."
    sp "По предварительным данным, лишь малая часть попадёт в нашу систему."
    sp "Ибо большая часть кластера или исчезнет по пути, оставив после себя газ и пыль, или будет притянута другими космическими объектами."
    "..."
    "Телеведущий всё продолжал..."
    "Я слушал внимательно, пытаясь запомнить самое важное."
    "Такого рода событие сложно себе представить."
    "Увидеть настоящий звездопад. Одна только мысль об этом заставляет меня трепетать."
    "Я всегда любил небо. Далекое небо, до которого я никогда не дотянусь."
    "Одна из моих мечт - заснуть под сиянием ночных звезд, тёплым летом в поле..."
    stop music fadeout 3
    "Для меня это было бы настоящим царством безмятежности."
    # Пролог: Утро - Город - Станция | Prologue: Morning - City - Station.
    scene bg_city_train_station
    with slowdissolve
    pause 0.3
    "Наконец я прибыл в FYTLu#324."
    "Вьезжая в город, поезд уже нигде не останавливался и помчался к центральной станции, петляя по всяким тоннелям и мостам."
    "Время - пол десятого, но я уже давно смирился с тем, что опоздал, ведь официально мой рабочий день начинается в девять..."
    me "\"Мне следует искрене извиниться, когда его увижу...\" "
    "Был бы у меня телефон, я мог бы позвонить и предупредить, что снова опоздаю."
    "И в очередной раз я страдаю от собственной глупости."
    "Я чувствую себя подавленным, но для меня это уже давно не в новинку."
    scene bg_city_main_station
    with slowdissolve
    pause 0.2
    "Я вышел из вагона и какое-то время просто рассеяно смотрел по сторонам, думая, как мне отсюда добраться в центр."
    "Не знаю точно, сколько я стоял, но через небольшой промежуток времени поезд отбыл."
    "И в этот момент, я увидел лицо знакомого человека, которого не ожидал здесь встретить."
    scene bg_city_main_station_norm
    with fastdissolve
    pause 0.1
    show key_usual at center
    un "..."
    hide key_usual
    "Уже при беглом взгляде я понял, кто это был."
    "Что ж, мне в любом случае придеться сегодня извиняться..."
    "Но причина опущенной головы и моего молчания была в том, что я просто уже не мог выдержать угрызения совести..."
    "А всё потому, что в этот день, этот парень самолично приехал забрать меня на работу."
    "Мне уже стало плохо от того, что я подумал, сколько это хлопот ему принесло."
    "Я глубоко вздохнул, повернулся к нему лицом, пристально посмотрел в глаза, и со всем виноватым видом, который я мог изобразить, искренне произнес:"
    show key_usual at center
    me "\"Пожалуйста, простите, что снова вас подвел!\""
    "Я сделал поклон, выразив как и уважение, так и признав свою вину."
    "Не то, чтобы сейчас подобные знаки и жесты были популярны в обществе, но я действительно хотел по-особому извиниться..."
    "Знакомьтесь, один из моих немногих друзей, а также по совместительству мой босс, Кей Константин Корнельевич..."
    play music lounge fadeout 6
    show key_usual_worried at center
    hide key_usual
    key "Эх..."
    key "Боже..."
    show key_usual_speaking
    hide key_usual_worried
    key "Не часто увидишь такое."
    key "Видимо тебе действительно жаль, раз уж ты прибегнул к формальной форме общения со мной."
    key "Видеть тебя таким немного необычно, поэтому, я думаю, что не зря прождал столько времени, находясь здесь."
    key "Поэтому я уже не сильно сержусь."
    show key_usual at center
    hide key_usual_speaking
    "Весьма ожидаемо. Этот человек может с легкостью понимать, что происходит у тебя в голове. Поэтому скрыть что-то от него будет нелегкой задачей."
    "Я не так давно знаком с Константином, но что точно я знаю, он весьма наблюдателен..."
    "В общении с друзьями, становится расслабленным, но часто уходит в себя. Правда, не всегда приятно слушать его мысли."
    "Может Кей сейчас и выглядит немного серьёзным, но он всегда такой, независимо от того, что делает."
    show key_usual_speaking at center
    hide key_usual
    key "Так, что-то мы долго тут стоим."
    "Его мягкий и задумчивый тон изменился."
    "Вместо этого голос стал более монотонным и деловым."
    key "Доброе утро. Как всегда, надеюсь на твою хорошую работу."
    "Вместе со своим стандартным приветствием, он протянул мне руку, а я, как всегда, крепко пожал её."
    "Сейчас на его лице уже не было того дружелюбия, а всё потому, что пришло время заняться делом."
    "А когда речь идёт о работе, он становится особенно внимательным и ответственным."
    me "\"Что ж, я уже готов на что угодно, Кей.\""
    hide key_usual_speaking
    "Несмотря на то, что он - мой босс, я обращаюсь к нему просто по фамилии, и не использую каких-либо формальных предложений."
    "Когда-то давно, а точнее еще при нашей первой встрече, он сам попросил называть себя просто Кей..."
    "На собеседовании его удивило, что я не выказываю ему никаких признаков уважения, а обращаюсь к нему, как к себе."
    "Затем он слегка посмеялся, сказав, что я первый, кто запросто может с ним так разговаривать."
    "Честно говоря, был бы это кто-другой, меня бы скорее всего выгнали из кабинета."
    "Но тогда, впервые заговорив с этим парнем, я понял, что лучше быть перед ним честным."
    "И это на удивление сработало."
    "..."
    stop music fadeout 3
    "Мы покинули место встречи и направились к его машине. Кей шел впереди, а я плелся рядом..."
    me "\"Что-нибудь особенное сегодня?\""
    show key_usual_speaking at center
    key "И да, и нет. Однако учитывая, что ты опоздал, то трудиться будешь допоздна."
    key "Без обид, считай это своим наказанием."
    show key_usual
    hide key_usual_speaking
    me "\"Хех...\""
    "Горько выдавил я из себя."
    "Сейчас Кей звучал так, будто упрекает меня как друг и как начальник одновременно."
    "А он всего-то на четыре года старше меня."
    "Если я, конечно, не запамятовал..."
    hide key_usual with fastdissolve
    # <НУЖНО 2 CG: 1 - УЛИЦА, ПО КОТОРОЙ ИДУТ ПЕРСОНАЖИ, 2 - ВИД С ОКНА МАШИНЫ> # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
    # Пролог: Утро - Город - Поездка в офис | Prologue: Morning - City - Going to the office.
    scene bg_city_streets with averagedissolve
    play music coolride fadeout 3
    "Выйдя со станции с западной стороны, мы вышли на широкий тротуар и пошли вверх по улице."
    # "По левую руку была проезжая часть, бок о бок с ней стояли высокие здания, а еще дальше за ними растянулся парк."
    # "Справа от нас возвышался аккуратный забор с клумбами, а вскоре этот пейзаж сменился на променад с квадратной плиткой, а по сторонам стали возвышаться стройные деревья."
    # "Сбоку от дороги изредка можно было увидеть небольшие скверы, обустроенные лавочками."
    "Людей на улице было немного."
    "Так как шли мы быстро, я не мог постоянно отвлекаться и рассматривать всё подряд, но, судя по всему, это был самый обычный городской день."
    "..."
    "И вскоре достигли места - парковочной зоны, - где Кей оставил свою машину."

    "С виду это был чёрный городской джип, как всегда выглядевший ухоженным."
    "Но и была у него важная особенность, отличающая его от девяноста процентов машин нынешнего мира."
    "Поначалу и не скажешь, но эта машина также использовала новую энергомеханическую систему с элементом XiJ."
    "..."
    # "Но, в отличие от электричек LDET-334, которая преобразовывала элемент в некое подобие электро энергии, в автомобилях элемент подвергался термо излучению."
    # "Эффективность этого заключалась в огромном количестве взрывной силы, что позволяла набирать скорость в 250 км/ч за полторы секунды, и развивать максимальную скорость до 600 км/ч ."
    # "Также плюсом являлось то, что сами по себе жидкокристаллические образцы XiJ давали много запасов энергии, а после их плавления автомобиль мог держать ту же скорость."
    # "То есть дополнительная подача энергии за счёт последующей термообработки элемента не была необходимой еще на долгий промежуток времени."
    # "Мало того, была разработана новая универсальная система экстра торможения."
    # "Те же самые частицы элемента XiJ резко подвергались криогенной обработке, и благодаря этому активная затрачиваемая энергия на движение моментально исчезала."
    # "Часть из которой возращалась в специальное stack хранилище, откуда могла быть извлечена и возвращена в эксплуатацию."
    # "..."
    # "Такие технологии, возможно, уже скоро станут частью повседневной жизни среднестатистического человека, но они ещё долго будут удивлять даже такого серого парня, как я..."
    "Мелкими приятными деталями, пожалуй, являются: новейшая система автовождения, улучшенная система безопаности, гибкое и аеродинамическое построение корпуса авто."
    "В таких машинах слова \"уют и спокойствие\" становились банальной повседневностью."
    "А называлась конкретно эта модель - ReZL_a0."
    "Обладать таким - действительно редкость. Не то, чтобы дорого, а пока не всем дозволено."
    "И неудивительно, что такую роскошь могут позволить себе только люди, как \"мистер\" Кэй."
    "..."

    "Во время поездки в офис, я равнодушно глядел в окно и лишь изредка обращал внимание на очередные проносившиеся мимо объекты."
    "Здания, люди, машины..."
    "Не поймите меня неправильно, на самом деле мне нравилось то, что я вижу, даже несмотря на то, что я уже привык часто приезжать в город."
    "На первый взгляд, казалось, всё было одинаково - обычные дни в современном мегаполисе..."
    "Но если быть чуточку внимательнее, то каждый день покажется тебе совершенно иным."
    "Эта повседневная рутина могла раздражать, на даже в ней можно было найти нечто особенное."
    "Или..."
    "Мне просто хотелось, чтобы так и было."
    "Каждый раз проезжая мимо знакомых мест, я невольно бросал взгляд в надежде увидеть что-то новое и необычное."
    "Но даже если какие-то небольшие детали и менялись."
    "То для меня общая картина оставалась одной и той же."
    # Пролог: Утро - Город - Безделье и Работа | Prologue: Morning - Lounging and Working
    scene bg_hall_labs_1
    with slowdissolve
    "Спустя какое-то время мы уже оказались в холле того самого здания, где располагался один из отделов кампании, в котором я и работаю."
    "На общем фоне строение выделялось среди обычных городских высоток, имело гораздо больше этажей, просторные комнаты, и было оборудовано первоклассной техникой."
    "Но к сожалению, последний пункт нельзя приписать к той части корпуса, куда я направляюсь вместе с Кейем."
    "Это не означало, что мы работаем в кустарных условиях."
    "Но если сравнить со здешними лабораториями, то наше оборудование выглядело жалко."
    "Тем не менее, никто и не жаловался, ведь нам всего хватало, и работали мы в достаточном комфорте."
    "А само здание и прилегающие территории принадлежали как-никак исcледовательской кампании XiJ."
    "Пройдя несколько этапов проверок, авторизации и удостоверения личности на ресепшене, мы направились дальше по коридору в сторону офисов."
    show key_usual at center
    with fastdissolve
    "..."
    "Пока мы шли, я заметил, что вокруг не шумно."
    show key_usual_speaking
    hide key_usual
    key "Рабочий день, а в коридорах тихо. Немного необычное явление, ты так не считаешь?"
    hide key_usual_speaking
    show key_usual
    me "\"Да, есть такое. Но ты же прекрасно знаешь всех здешних сотрудников, особенно тех лабораторных крыс.\""
    hide key_usual
    show key_usual_speaking
    key "Верно. Стоит заметить, что мои подчиненные уже привыкли жить бок о бок с коллегами из старшего исследовательского отдела... Что нельзя сказать про тебя."
    key "Я понимаю, ты здесь недавно и ещё не ко всему привык."
    key "Однако помни, твоя самая главная обязанность - не доставлять проблем корпорации XiJ."
    hide key_usual_speaking
    show key_usual
    "..."
    hide key_usual
    show key_usual_speaking
    key "Ты же понимаешь, что я напоминаю это не просто так: являясь моим подчинённым, ответственность за тебя будет нести моя компания."
    "Я кивнул ему, выражая своё понимание, ибо  моё дальнейшее молчание ни к чему бы не привело."
    hide key_usual_speaking
    with averagedissolve
    stop music fadeout 3
    "Мы поднялись по ступенькам, ведущих к лифту."
    "..."
    show bg_nothing
    with slowdissolve
    scene bg_hall_labs_2
    with slowdissolve
    play music drifting2 fadeout 2
    "И вскоре оказались на нужном этаже."
    "Он практически ничем не отличался от холла, учитывая, что здание везде было спроектировано одинаково."
    "Идя рядом с Кейем, я продолжал думать..."
    "Кампания именитого рода, сейчас принадлежащая отцу Кея, скоро перейдет уже в его руки..."
    "В руки парня, не сильно старшего меня."
    "О каком-либо сравнении меня с ним не может быть и речи."
    "Сама из себя кампания с именованием \"H-Dep\" была некоего рода профессиональной конторой по теоритическим разработкам в разных областях, хотя преимущественно занималась предоставлением юридических услуг."
    "Сотрудники этой кампании обучались в специально созданных учреждениях, каждый из них был своебразным эрудитом во многих областях."
    "Такие талантливые люди занимали высокие должности в этой кампании, и сам Кей не был исключением, причем не из-за его причастности к роду руководителей H-Dep."
    "Тем же, кто по каким-либо причинам не смог добиться высоких результатов, ждало более низкое место в иерархии."
    "Они были обречены быть подопечными вышестоящих боссов, и выполнять любую соответствующим им работу."
    "С самого начала существования, девизом кампании был \"Синергия Во Всём\"."
    "Начальтсво и работники всегда стремились создать максимальную эффективность в сотрудничестве с их работадателями, выполнять возложенную на них работу максимально быстро и качественно."
    "Такой тип мышления был, есть, и всегда будет абсолютно во всех кампаниях мира, но разница состоит в том, что H-Dep преуспели в этом лучше остальных."
    "Занимаясь всякого рода документацией, отчетами, доставкой  и проверкой информации, кампания обучала своих будущих работников так, чтобы они были специалистами практически во всем,"
    "без проблем понимали, о чем говорит какой-то сосед ученый, юрист, медик, да и кто бы там ни был."
    "\"Абсолютное понимание рождает эффективность\" - такой вывод можно сделать из того, к чему стремится H-Dep."
    "И именно по этой причине, корпорация XiJ будет заинтересована в подобного рода помощниках, ведь последние могут тихо выполнять возложенную на них задачу,"
    "пока ученые и инженеры самой XiJ сосредотачиваются на более насущных вещах."
    un_n "Кей Корнельевич, можно вас на пару минут?"
    "И сейчас, идя прямо по коридору, минуя всякие боковые проходы, я направляюсь в то место, где множество разнообразных и несколько неординарных личностей занимаются своей работой."
    show natali_usual at right with averagedissolve
    show key_usual at left with averagedissolve
    "Я уже собрался войти в зал и услышал, как какая-то женщина обратилась к Кею."
    show key_usual_smiles at left with fastdissolve
    hide key_usual
    "Кей глазами намекнул мне, чтобы я его не ждал и двигался дальше."
    "Действительно, мне нет никакого дела до их разговора."
    scene bg_main_office
    with normdissolve
    "В общем зале было не очень шумно."
    "Солнечный свет слабо пробивался через большие окна."
    "Не редкое зрелище: мы находились на довольно большой высоте, и тут часто господствовал туман."
    "Люди с серьезным и важным видом то и дело перешептывались и, наоборот, говорили громко."
    "Некоторые сновали туда-сюда по обширной площади комнаты, перетаскивая коробки, файлы и канцелярскую утварь."
    "Кто-то сидел за компьютером и спокойно тарабанил по клавиатуре..."
    "Были и те, кто потягивал кофе и листал какие-то документы."
    "..."
    "Я чувствовал еле заметный аромат дерева и мебели."
    "..."
    "Несмотря на то, что рабочий день давно начался, народу здесь было, пожалуй, не слишком много."
    "Бывали дни, когда нельзя было и протолкнутся."
    "Но такое, к счастью, являлось редкостью."
    stop music fadeout 3
    "Слегка опустив голову, с картинным и бесстрастным выражением лица, я медленно брел среди довольно высоких стеллажей, по узкому проходу между столами-кабинетами, по возможности пропуская всех, кто попадется на пути."
    "Я все еще находился во втором ряду общего зала, если начинать считать от окон справа."
    "Я вел себя так каждый раз, когда появлялся в этом зале, чтобы не привлекать лишнее внимание."
    "К тому же, мне не предстояло беседовать с кем-то из этих людей: меня ждет своя работа в другой комнате."
    "Я ровно шел к противоположной части зала, к двери, что была по центру."
    "Но как только я прошел пол пути, зал практически мгновенно стих."
    "\"Черт, не успел...\""
    "Только я успел промямлить про себя, как по залу разнесся спокойный, но в то же время воодушевленный голос:"
    key "Доброе утро, господа."
    key "Желаю всем продуктивного дня."
    "После чего народ утихомирился, и в зале воцарилось определенное спокойствие."
    "Уже точно никто не хотел привлекать к себе лишнее внимание, и каждый был занят своим делом."
    "Я шел дальше, не оглядываясь."
    "Позади я слышал, как Кей двигался по моему ряду: люди радостно приветствовали его."
    "Вскоре я почувствовал, как на мое плечо легла его рука - это был жест, который говорил мне остановиться."
    "Я так и сделал, развернувшись с недовольным выражением лица к Кею."
    show key_usual_smiles
    with fastdissolve
    key "Я понимаю, что тебе не терпится начать, но мы не подождали остальных."
    "Да, конечно. Вот только сейчас, я спешил работать не по той причине, что мне сильно хотелось..."
    "Ведь теперь, когда мы стояли рядом, некоторые взгляды из зала устремились на меня."
    "\"Опоздавший\"."
    "И в тот момент я почувствовал, будто в меня вонзаются тоненькие колючки."
    "А особенно..."
    hide key_usual_smiles
    with fastdissolve
    show key_usual_smiles:
        xalign 0.3
        yalign 1.0
    with fastdissolve
    show enji_irritated:
        xalign 0.65
        yalign 1.0
    key "..."
    show enji_contemptuous:
        xalign 0.65
        yalign 1.0
    hide enji_irritated
    un_e "..."
    un_p "Йо!"
    "Последнее явно было адресовано мне, так как прозвучало практически под ухом..."
    "Кажется, один очень знакомый мне человек позади никак не может быть спокойным и тактичным по отношению к товарищам."
    scene bg_main_office
    with fastdissolve
    show phil_usual at center
    with fastdissolve
    me "\"Полегче, Фил\"."
    hide phil_usual
    show phil_smiling at center
    with fastdissolve
    "Я лишь мог вздохнуть про себя, что этот тип никогда не меняется..."
    hide phil_smiling
    show phil_usual:
        xalign 0.2
        yalign 1.0
    with fastdissolve
    show key_usual_smiles:
        xalign 0.45
        yalign 1.0
    with averagedissolve
    show enji_contemptuous:
        xalign 0.7
        yalign 1.0
    with averagedissolve
    play music corporationmotivation fadeout 2
    key "Ну, кажется, всё в порядке."
    "Кей тоже подметил это, и быстро оглядел нашу троицу."
    "Да, долго ждать не пришлось."
    "Сейчас Кей скажет: \"Команда в сборе.\""
    "Каждый поприве́тствует друг друга, затем он раздаст указания, и дальше всё будет как обычно..."
    show key_usual_speaking:
        xalign 0.45
        yalign 1.0
    with fastdissolve
    hide key_usual_smiles
    key "Все в сборе, оперативно. Доброе утро Фил. Доброе утро Энджи. Рассчитываю на вас."
    show key_usual:
        xalign 0.45
        yalign 1.0
    with fastdissolve
    hide key_usual_speaking
    "Энджи кротко кивнула."
    show phil_speaking_kindly:
        xalign 0.2
        yalign 1.0
    with fastdissolve
    hide phil_usual
    phil "Выложимся на полную!"
    "Ответил, будто отрапортовал..."
    show phil_usual:
        xalign 0.2
        yalign 1.0
    with fastdissolve
    hide phil_speaking_kindly
    show key_usual_speaking:
        xalign 0.45
        yalign 1.0
    with fastdissolve
    hide key_usual
    key "Правильный настрой, в отличии от кое-кого опоздавшего..."
    show key_usual:
        xalign 0.45
        yalign 1.0
    with fastdissolve
    hide key_usual_speaking
    "Ить!"
    "Кей вспомнил это в самый неудобный для меня момент..."
    "Фил легкомысленно протянул:"
    phil "Впрочем, ничего нового. Но лучше не вырабатывай такую привычку."
    "Но в то же время это прозвучало как-то утонченно и философски глубоко..."
    show enji_irritated:
        xalign 0.7
        yalign 1.0
    with fastdissolve
    hide enji_contemptuous
    enj "...хех..."
    "..."
    "Я ничем не мог ответить на вполне естественное раздражение Энджи."
    "Какие бы отговорки я ни любил придумывать, сейчас им здесь было не время и не место."
    show enji_usual:
        xalign 0.7
        yalign 1.0
    with fastdissolve
    hide enji_irritated
    "И в этот раз я чувствовал себя особенно виноватым."
    "Заслужить презрение этой гордой девушки весьма просто."
    "И, как и следовало ожидать, когда-то я умудрился сделать это почти сразу..."
    "Кроме, собственно, опозданий, была еще пара глупо спровоцированных ситуаций..."
    show key_usual_speaking:
        xalign 0.45
        yalign 1.0
    with fastdissolve
    hide key_usual
    key "Не будем терять время."
    hide key_usual_speaking with slowdissolve
    hide phil_usual with slowdissolve
    hide enji_usual with slowdissolve
    "Кей начал рассказывать и довольно информативно объяснять, что и кому предстояло сегодня сделать."
    "В основном его речь касалась Энджи."
    "Фил стоял и слушал, периодически поддакивая."
    "Я уже пару минут апатично оглядывал стены и потолок офиса, лишь краем уха слушая то, что говорит Кей."
    stop music fadeout 3
    "Хоть мы втроем и считались \"командой\"..."
    "На самом деле, это слово все еще не имело силы."
    "Нас объединяло только то, что мы втроем были любимцами Кея, то есть он нам как подчиненным уделял больше времени..."
    "Также, если брать его отдел, мы были самые молодые, к тому же считались тут новобранцами."
    "И это была его идея сделать из нас что-то вроде специально работающей группы."
    "Фил был первым из нас, кого Кей нанял, Энджи - второй."
    "Сам я тут совсем недавно, но возможности узнать лучше кого-либо из них мне не хватало."
    "Во время рабочего дня мы изредка пересекались, и могли перекинуться всего лишь парой слов по делу."
    "А так, каждый из нас был занят своими проблемами."
    "..."
    enj "Эй!"
    "!?"
    play music different fadeout 2.5
    scene bg_main_office
    show enji_angried
    with fastdissolve
    "Когда я обернулся, ни Кея, ни Фила уже не было..."
    "Более того, я остался один на один не с самым приятным собеседником."
    show enji_angry_speaking
    with fastdissolve
    hide enji_angried
    enj "Что ж, похоже, ты не только любишь опаздывать, а еще и предпочитаешь витать в облаках."
    show enji_irritated
    with fastdissolve
    hide enji_angry_speaking
    enj "Боже..."
    "Кажется, чайник начал закипать..."
    "Но у меня тогда такой вопрос."
    "Что она тут..."
    show enji_speaking
    with fastdissolve
    hide enji_irritated
    enj "Почему я еще здесь, верно?"
    "Я вздохнул."
    enj "Твои глаза тебя выдают. Ты как открытая книга."
    show enji_usual
    with fastdissolve
    hide enji_speaking
    "Кажется, до меня начало доходить."
    "Обычно Энджи уходила вместе с Кейем, а я и Фил разбредались по своим рабочим местам."
    "И раз она тут..."
    show enji_speaking
    with fastdissolve
    hide enji_usual
    enj "Да, я не получила никакого особого задания от мистера Кея."
    enj "Но это не значит, что я собираюсь валять дурака."
    show enji_thinking
    with fastdissolve
    hide enji_speaking
    "Я решил кое-что уточнить."
    me "\"Раз уж так вышло, Кей не поручал мне ничего особенного?\""
    show enji_speaking
    with fastdissolve
    hide enji_thinking
    enj "Нет, как я поняла, сегодня ты занимаешься тем же, чем и обычно."
    enj "Не мешкай и приступай."
    show enji_angry_speaking
    with fastdissolve
    hide enji_speaking
    enj "Принц-коротышка уже во всю старается. Не думала, что когда-либо это скажу, но тебе стоит поучиться у него трудолюбию и выносливости."
    show enji_angried
    with fastdissolve
    hide enji_angry_speaking
    "Я решил возразить."
    me "\"Брать пример с Фила? Да у него по жизни ветер в голове.\""
    show enji_angry_speaking
    with fastdissolve
    hide enji_angried
    enj "Не пойми неправильно. Разговаривать с ним - сплошная морока, но во время работы он хотя бы старается. Более того, у него даже есть талант кое в чем."
    show enji_upset
    with fastdissolve
    hide enji_angry_speaking
    enj "Если бы не его наивность..."
    show enji_contemptuous
    with fastdissolve
    hide enji_upset
    "Мне показалось, или я на секунду увидел грусть в глазах Энджи?"
    show enji_usual
    with fastdissolve
    hide enji_contemptuous
    enj "..."
    "..."
    show enji_angry_siding
    with fastdissolve
    hide enji_usual
    "..."
    enj "..."
    "Разговор дальше не шел..."
    "Какое-то время мы рассеяно смотрели по сторонам."
    "Хотя скорее похоже было на то, будто каждый из нас ожидал действий оппонента."
    "Энджи все еще излучала ауру враждебности и презрения."
    "И вроде диалог не остался без внимания."
    "На нас понемногу начали пялиться сотрудники офиса."
    "Я снова начал чувствовать неприятное покалывание в теле."
    show enji_contemptuous
    with fastdissolve
    hide engie_angry_siding
    enj "..."
    "Взглядом Энджи намекнула мне убираться отсюда."
    "Я и так собирался, причем уже давно."
    "Но то, с каким пренебрежением она это сделала."
    "Я решил не остаться в долгу, и, проходя мимо нее, подобрав нужный тон, с сарказмом ляпнул:"
    me "\"Слушаюсь и повинуюсь!\""
    hide enji_contemptuous
    show enji_usual
    with fastdissolve
    "Наверное, я поступил мерзко, ведь я даже не посмотрел ей лицо."
    stop music fadeout 3
    hide enji_usual
    with averagedissolve
    "Но..."
    "Она ничего мне не ответила, чему я слегка был удивлен."
    "Может, она просто не хотела привлекать внимания других?"
    "А если это бы произошло в пустом коридоре, получил бы я сдачу?"
    "Или,возможно, она действительно терпеливей, чем кажется..."
    # Пролог: Утро - Город - Безделье и Работа 2 | Prologue: Morning - Lounging and Working 2
    scene bg_mh_office
    with slowdissolve
    "Какое-то время я сидел в своем кабинете."
    "Было немного пыльно, повсюду лежали коробки."
    "Я открывал каждую, брал нужное, потом перетаскивал их на место."
    "Делать было действительно много..."
    "Мой рабочий день официально заканчивается в шесть..."
    "Но похоже я тут задержусь, в лучшем случае, до восьми."
    "Я начал бубнить себе под нос, чтобы немного приободриться."
    me "\"Это отсортировать, тут проверить, там посчитать...\""
    me "\"Вот здесь написать отчет, там составить накладную...\""
    me "\"Это занести в базу. А вот это еще нужно отправить в отдел кадров.\""
    me "\"Вот эти вещи потом в лабораторию...\""
    play music lounge fadeout 2
    "Я занимался делами, ставшими для меня рутиной совсем недавно."
    "Как я и говорил, я был всего лишь мальчиком на побегушках у Кея."
    "То есть он сваливал на меня подобного рода работу."
    "Как директор своего отдела, и как будущий директор кампании H-Dep, он был весьма трудолюбив, однако лидеру не пристало решать такие низкосортные проблемы."
    "Но игнорировать существование таких вещей - нельзя. Всё до мелочи должно быть выполнено."
    "Поэтому, есть я - третий ассистент Кея."
    "Честно говоря, я имею мало представлений, чем сейчас занимаются Энджи и Фил."
    "Из того, что я знаю, Фил задействуется везде, где только возможно. По крайней мере, я думаю, что Фил за день успевает побывать как и в тех. отделе, так и в архивах."
    "А Энджи, в свою очередь, Кей всё время держит при себе."
    "Иногда может показаться, что Энджи - это вице-президент компании."
    "Тем не менее, это не так. Как я понял, Энджи действительно выполняет самую ответственную работу, если сравнивать со мной и Филом."
    "У неё хорошие академические способности, поэтому я не удивлюсь, если ей уже поручают руководить небольшими проектами,"
    "связанными с изучением и анализом данных."
    "Думаю, она без особых проблем сможет получить должность бизнес-аналитика."
    "А учитывая её способность смотреть в корень вещей..."
    "Её таланты точно пригодятся компании."
    "Я думаю, у Кея большие планы на неё, учитывая, как внимательно он её наставляет."
    "А вот что можно сказать про меня..."
    "То я до сих пор удивляюсь, что я тут делаю, и почему меня вообще взяли..."
    "..."
    "Отогнав все лишние мысли прочь, я тщательнее погрузился в чтение внушительной кипы бумаг с метаданными, связанных с моим текущим заданием..."
    scene bg_mh_office
    with fade
    "..."
    "\"Э-эхх.\""
    "Я сладко потянулся."
    "Часы на стене тут не работали, но начался обеденный перерыв..."
    "Ведь сейчас из одного динамика на противоположной стене играла мягкая мелодия."
    "Она всегда оповещает нас о начале и конце перерыва..."
    "Обычно это время я проводил в одиночестве."
    "Ходил в столовую, покупал какую-нибудь еду, и возвращался сюда."
    "Хорошо было бы взять перерыв."
    "Но с другой стороны, может мне стоит работать дальше, чтобы пораньше вернуться домой?"
    stop music fadeout 2
    menu:
        "Хотелось бы всё-таки отдохнуть":
            jump choice1_retard

        "Продолжить работать":
            jump choice1_work

label choice1_retard:
    $ flague_choice1_retard = 1
    "..."
    me "\"Вот и прекрасно.\""
    "Промямлил я, вскочил со стула и направился в коридор."
    scene work_cafe_evening with fade
    "..."
    "Незаметно для себя я оказался в знакомом месте."
    "Это кафе находится несколькими этажами ниже, а по пути сюда я не встретил ровным счетом никого."
    "Не то что бы я удивлялся..."
    "Обычно здесь немного народу, даже в обеденное время, но сегодня я вынужден есть в одиночетсве."
    "Возможно, так даже лучше."
    "Мне не всегда интересно слушать чью-то болтовню за столом, лицезреть какой-нибудь флирт или что-нибудь подобное."
    "Хотя, мне должно быть всё равно, ведь окружающие меня незнакомцы никак не влияют на мою жизнь..."
    "Но включить полное игнорирование происходящего я не могу."
    "Ладно бы столовая была побольше..."
    "А глагольствовать о приличии было бы не уместно."
    "Я бывал здесь всего несколько раз, поэтому еще ни с кем не познакомился."
    "Я даже не знаю, кто тут претендует на роль постояльца."
    "..."
    "Я купил себе большой сендвич и кофе, уселся у окна, и принялся неспешно жевать."
    "Не прошло больше минуты, как..."
    "Гух!"
    show phil_smiling with fastdissolve
    phil "Йо!"
    phil "Увидел тебя с кислой миной и решил присоединиться."
    "Ну, да, конечно."
    "Кого-кого, а вот Фила я ожидал увидеть здесь меньше всего."
    "Не знаю почему, но вот такое чувство у меня возникло."
    me "\"А ты не думал, что завалиться в столовую с этими коробками не очень-то удобно?\""
    show phil_usual
    hide phil_smiling with fastdissolve
    play music goodvibes fadeout 2
    phil "Аххх, да, прости. Я просто тащил их в свой кабинет, вспомнил, что сейчас есть немного времени перевести дух, и решил сразу заглянуть сюда."
    phil "На самом деле, не ожидал тебя тут встретить."
    phil "И тут сегодня тихо."
    phil "В общем: чё, как оно?"
    ".?."
    me "\"Та вроде неплохо. И ничего необычного...\""
    phil "Тоска замучала?"
    me "\"Немного устал. Хотя обычно я более стойкий.\""
    "А он, в принципе, ведет себя как и обычно."
    "Нет и намека на усталость и раздражение."
    "Похоже, он такой всегда. И, наверное, именно эту его постоянность имела в виду и Энджи."
    "По сути, я о нем тоже ничего не знаю."
    "Только то, что он может влиться в любую кампанию, везде и всюду успевает, и всегда старается нивелировать возможность конфликта..."
    "А по таким признакам я не могу сказать, какая он личность."
    me "\"Я так понимаю, у тебя не одна фамилия, да?\""
    show phil_smiling
    hide phil_usual with fastdissolve
    phil "Да. Кажется, у тебя был разговор с Энджи. Ты из него это понял?"
    me "\"По крайней мере были основания полагать.\""
    phil "Всё верно. Но, пожалуйста, не слушай, что говорит Энджи-семпай. Её иногда заносит."
    me "\"Охотно верю. \"Принцесса\" звучит очень неловко...\""
    phil "Правильно будет \"Принцепс\"."
    show phil_usual
    hide phil_smiling with fastdissolve
    phil "Ну, я про фамилию..."
    me "\"Никогда такой не слышал. Но постой, раз у тебя вторая фамилия, значит ли?..\""
    "Я хотел закончить свою мысль, но решил оборваться."
    "Похоже, я забежал наперед..."
    "Фил лишь негодующие взглянул на меня, явно ожидая продолжения."
    "Я хотел спросить, не скрывает ли он настоящую фамилию из-за своего прошлого или прошлого его семьи."
    "..."
    "Пока не буду трогать такие темы, ведь я всего лишь хотел узнать его фамилию, пускай, возможно, и не настоящую."
    "Кажется, Фил недогадлив и не понял, о чем зашла речь."
    "Или притворяется таким."
    me "\"Неважно.\""
    me "\"Так что это за коробки, которые ты принес? Судя по звуку, там стекло и пластик.\""
    "Он поправил очки и незамедлительно ответил."
    show phil_speaking_kindly
    hide phil_usual with fastdissolve
    phil "Да, точно. Я, как обычно, заработался и потерял счет времени."
    phil "Я должен был отнести их в лабораторию. Но потом вспомнил, что сначала необходимо проверить пробирки у себя в кабинете, а дальше поставить все точки над и в..."
    me "\"Так, ясно. Так ты сотрудник лаборатории? Я не знал...\""
    phil "Да, на самом деле меня перевели туда недавно. В колледже я активно изучал биологию, но..."
    show phil_usual
    hide phil_speaking_kindly with fastdissolve
    "Тут энтузиазм Фила прервался."
    phil "Но потом я был вынужден бросить учебу, и когда я думал, что больше никогда не вернусь к исследованиям, появилась надежда."
    phil "И я не отказался от второго шанса."
    ".?."
    show phil_smiling with slowdissolve
    hide phil_usual with fastdissolve
    phil "Я часто беседую с Кейем, и он написал рекомендательное письмо в местный отдел XiJ, за что я перед ним в большом долгу."
    me "\"И это причина твоего усердного труда?\""
    phil "Не только. Сколько я себя помню, я просто старался делать всё как можно лучше."
    phil "На самом деле, мне только дали испытательный срок. Поэтому я обязан трудиться на все 200 процентов."
    phil "У меня есть желание совершенствоваться в медицине."
    show phil_usual
    hide phil_smiling with fastdissolve
    me "\"И кем в итоге ты хотел бы стать?\""
    show phil_smiling
    hide phil_usual with fastdissolve
    phil "У меня никогда не было никаких талантов, поэтому я думаю, что потяну лишь на фармацевта."
    phil "Но я не собираюсь заниматься нишевой работой, а хочу как раз-таки остаться в лаборатории."
    me "\"Что ш, славно.\""
    "Я стараюсь засыпать его вопросами, чтобы в ответ он не успевал сделать тоже самое."
    "Мне не лень открыться человеку, который так со мной откровенничает, но всё же я пока не готов."
    hide phil_smiling with slowdissolve
    "Я так и не узнал, что в коробках, но думаю это уже не так необходимо, ведь я получил более ценную информацию."
    "Пока я нервно постукиваю пальцами по покрытию стола, в ожидании того, что я дальше предприму, Фил покупает себе рис с овощами."
    show phil_smiling with averagedissolve
    me "\"Приятного.\""
    "Он садится напротив меня, и начинает быстро поглощать еду, немного плямкая."
    "Судя по пакетикам вокруг его тарелки, он большой любитель специй, ведь то и дело он иногда особо сильно щурится."
    "Кажется, ему это только в радость."
    "И всё это время, что я провожу с ним, улыбка не сходит с его лица."
    "Наверное, это вошло у него в привычку. Это не означает, что во время разговора он может скрыть свои настоящие эмоции."
    "Иногда он может хмуриться или смущаться, но в такие моменты всё равно улыбается."
    "У Фила маленький рост, он даже на голову ниже Энджи. К тому же, судя из наших разговоров, он на несколько лет младше меня."
    "Тем не менее, я уверен, что ему по душе почти любой собеседник, а разница в возрасте для него не играет существенной роли."
    "..."
    "..."
    "Не знаю, сколько времени прошло, но я уже почти допил свой кофе."
    "Сытость от моего сендвича, несмотря на то, что он был знатным, лишь эхом отдается в моём животе."
    "Я уже собирался уходить, как мое внимание подцепило кое-что странное."
    me "\"Ты запиваешь васаби КОЛОЙ ?\""
    "Сначала я подумал, что мне показалось, но Фил сделал глоток из бутылки как ни в чем не бывало..."
    show phil_speaking_kindly
    hide phil_smiling with fastdissolve
    phil "Уххх! Теперь я чувствую себя собой!"
    "После моего всплеска эмоций я попытался скорчить безразличное лицо, но это больше не имело значения."
    phil "Да, а почему бы и нет. По-моему, выглядит круто."
    me "\"Что за приколы? Я острые чипсы не всегда могу запить колой, а ты до васаби съел еще тучу специй.\""
    "А-а, я спалился, что люблю чипсы..."
    "Да, Фил всё-таки временами бывает странным. Возможно, это только вершина айсберга."
    "До этого я не видел у него особых приколов, ведь мы мало знакомы, но наверное Энджи была права на его счет."
    phil "В том-то и дело. Я просто не могу без колы. У меня проблемы с пищеварением после такого рода еды, и в такие моменты кола для меня - целительная вода."
    show phil_smiling
    hide phil_speaking_kindly with fastdissolve
    "В этом случае с ним не поспоришь, но..."
    "Я думаю, что он устроил себе какой-то замкнутый круг: ест острую пищу - запивает её колой ради улучшения её растворения, тем самым создавая себе американские горки во рту."
    "Кола помогает быстрее усвоиться жирной еде, но если он постоянно питается только острым, то в его ситуации недалеко дойти до диабета или язвы..."
    "А всё из-за его страсти к подобной пище и возможностью \"запить\"."
    "Почему бы не найти какие-нибудь таблетки, которые заменят колу и не будут так вредны?"
    phil "..."
    "Фил странно на меня смотрит, будто мои мысли совершенно его не волнуют."
    "Ладно, я пока оставлю эту тему, ибо вразумить его мне просто лень."
    "Скорее всего, я поспешил с выводами, поэтому не буду задираться и переведу тему."
    me "\"Что думаешь об Энджи?\""
    "Недолго думая, он отвечает растерянно."
    show phil_usual
    hide phil_smiling with fastdissolve
    phil "Довольно сложный вопрос. Я думаю, она не совсем такая, какой кажется на первый взгляд."
    phil "Она плохо ладит с окружающими, выглядит всегда немного грустной."
    phil "Я всегда пытаюсь её подбодрить, но в итоге всё заканчивается не слишком хорошо."
    show phil_speaking_kindly
    hide phil_smiling with fastdissolve
    phil "Но поверь, я обязательно стану её другом!"
    "Ему, как оказалось, вообще по барабану, что я перевёл тему, ну и хорошо."
    me "\"Ну и с чего бы тебе это делать?\""
    phil "Ничего особенно, просто я чувствую, что общаясь с ней, могу узнать много нового."
    "А он любыпытный, значит..."
    show phil_usual
    hide phil_speaking_kindly with fastdissolve
    phil "Однако мне пока не удалось как-то в этом продвинутся."
    phil "Я лишь случайно узнал, что она находится здесь не только из-за своих талантов, но также из-за положения в обществе."
    "..."
    phil "Да, я почему-то уверен, что это именно так."
    me "\"Есть пруфы?\""
    phil "Сплетни считаются?"
    me "\"Сомневаюсь.\""
    phil "Если не сочтешь это грубостью, прими мой совет: пожалуйста, будь поаккуратней с Энджи."
    me "\"Ага.\""
    me "\"Любишь советовать людям то, что тебе самому не хватает? Па́нимаю.\""
    phil "Ммммм, да, прости."
    "Легко хихикнул Фил."
    "И внезапно стал необычайно оживленным."
    show phil_speaking_kindly
    hide phil_usual with fastdissolve
    phil "Кстаааааааа-ти!"
    phil "Скоро в городе появится большая движуха, не хочешь остаться на выходные и поглядеть со мной?"
    phil "К тому же, тебе будет где остановиться, поэтому обязательно соглашайся."
    me "\"И что же такого произойдет необычного?\""
    phil "Точно не знаю, сам особо не интересовался, но есть слухи, что в ближайшую неделю будет какая-то массовка в центре."
    phil "Я думаю, тебе должно понравится."
    phil "К тому же, ты же не отсюда, так что тебе здесь наверняка всё в новинку. А я с радостью проведу экскурсию по знаметим местам!"
    show phil_usual
    hide phil_speaking_kindly with fastdissolve
    "Вообще-то, я когда-то жил в этом мегаполисе, правда в другом секторе, но я, пожалуй, сделаю вид, что мало со всем этим знаком."
    "Не хочу, чтобы Фил это знал, а то мало ли что ему в голову взбредёт."
    "Не могу сказать, что предложение меня не заинтересовало."
    "Я трачу вагон времени на возвращение домой, поэтому на развлечения его не особо хватает."
    "Всё-таки иногда хотелось бы оттянуться как следует."
    "А бесплатное жильё и еда выглядят заманчиво."
    stop music fadeout 2
    "Я----"
    menu:
        "охотно приму предложение":
            $ flague_phil_proposition = 1
            $ phil_p += 1
        "вежливо откажусь":
            pass

    if flague_phil_proposition == 1:
        me "\"Почему бы и нет.\""
        show phil_smiling
        hide phil_usual with fastdissolve
        phil "Отлично! Уверен, ты не пожалеешь."
    else:
        me "\"Прости, не получится...\""
        show phil_smiling
        hide phil_usual with fastdissolve
        phil "Ну, ладно. Я просто предложил."
        "Я услышал нотки разочарования в голосе Фила."
        "Но, кажется, это его не сильно расстроило, отчего я испытал небольшое облегчение."

    show phil_nervous with fastdissolve
    hide phil_smiling
    phil "Ась!?"
    "Резкая смена настроения Фила заставила меня почувствовать дискомфорт."
    "Будто я забыл что-то важное."
    show phil_bittersweet with fastdissolve
    hide phil_nervous
    phil "Боже мой, сколько уже времени прошло."
    phil "Прости, но мне нужно спешить! Я и так уже опоздал... Мне еще с коробками возиться."
    hide phil_bittersweet with fastdissolve
    "Я быстро обернулся и взглянул на часы."
    "Обеденный перерыв закончился почти двадцать минут назад."
    "Он действительно не очень большой, хватает времени лишь на то, чтобы быстро и плотно поесть, и перекинуться парой слов, но уж точно не вести длинные беседы."
    "Я вскакиваю, машу рукой Филу на прощание, и про себя гадаю, почему я не услышал мелодию-оповещение о конце перерыва..."
    "Кажется, я на время усыпил свою бдительность, а я ведь замечал, что Фил легкомысленный и может быстро расслабиться, потянув всех за собой."
    if flague_phil_proposition == 0:
        "Удаляясь, я слышу как Фил кричит мне напоследок."
        phil "Если передумаешь - дай мне знать!"

    jump choice_after_retard

label choice_after_retard:
    scene bg_mh_cabinet_evening
    with slowdissolve
    "Оставшееся время я трудился в поте лица."
    "Работы было настолько много, что под конец я решил расслабиться, учитывая то, что сегодня я не успею всё закончить."
    "Я не чувствовал себя сильно уставшим, ибо в обед так знатно перевел дух, но мысли мои блуждали в тумане."
    "И если потом окажется, что я где-то напортачил или что-то просчитал, мне стоит ждать нагоняй, в худшем случае, от всего отдела..."
    jump choice1_end


label choice1_work:
    "..."
    "Что ж, быстрее начну - быстрее закончу."
    "Ощущая утомительную тяжесть в теле, я снова приступил к делу."
    "Уже работалось не так легко, как в первой половине дня, поэтому иногда я начинал ошибаться."
    "Время от времени хотелось пить, поэтому я наливал воду из экстрактора в пластиковый стакан."
    "Жарко не было, к тому же был включен кондиционер, но всё-таки я немного вспотел."
    "..."
    "..."
    scene bg_mh_cabinet_evening
    with fade
    me "\"Что ж, сегодня я управился быстрее, чем ожидалось.\""
    "Похоже, не брать перерыв было хорошей идеей."
    "Но если потом окажется, что я где-то ошибся, мне стоит ждать нагоняй, в худшем случае, от всего отдела..."
    jump choice1_end

label choice1_end:
    "..."
    "Я заканчивал небольшую уборку, поставив коробки в угол комнаты, и убрал лишние принадлежности в стол и шкафчики."
    "Понятия не имею, который сейчас час, но солнце уже точно садилось."
    "Возможно, западную часть здания еще омывали теплые лучи, но в кабинете уже было немного темновато."
    "Я не включал свет, так как уже положил нужные вещи в мой \"дорожный\" портфель."
    "Сейчас мне следовало зайти к Кею и сказать, что на сегодня я всё..."
    "Последний раз оглянув комнату, вздохнув от облегчения, я вышел в коридор."
    scene bg_outdoor_stairs
    with averagedissolve
    play music lounge fadeout 2
    "Петляя по узким коридорам в восточной части здания, где располагались комнаты, похожие на мой кабинет, я наконец очутился возле знакомого лестничного пролета."
    "Повсюду было множество небольших ярких LED ламп, что создавало не очень приятное впечатление в сочетании с идеально белыми стенами."
    "Поэтому я немного нервничал, оказавшись в подобного рода местах..."
    "..."
    "По-хорошему, мне нужно было воспользоваться лифтом, так как кабинет Кея находился многими этажами ниже."
    "Но вдруг... я вспомнил."
    "После работы я иногда любил подниматься на крышу."
    "Когда-то это даже было моей мечтой - посмотреть пейзаж мегаполиса, находясь на крыше высотного здания."
    "Не так давно моя мечта исполнилась, когда я в первый же вечер рабочего дня наслаждался видом города."
    "Причем, такой сюрприз для меня Кей сделал собственной персоной..."
    "С тех пор я иногда любил приходить туда, и наслаждаться свежим вечерним воздухом."
    "Ну...настолько \"свежим\", насколько это возможно."
    "Хотя, расположению здания повезло. Оно находилось вдали от больших автодорог и магистралей."
    "То есть тут был своеобразный микрорайон."
    "..."
    stop music fadeout 2
    "Голова болела - усталость брала своё."
    "Наверное, лучше пойти к Кею, и побыстрее уехать домой."
    if flague_choice1_retard == 0:
        "..."
        me "\"Эх\"..."
        "Во мне пробудилось желание подняться на крышу еще разок."
        "Поэтому я..."
        menu:
            "Поднимусь туда":
                jump choice2_roof

            "Всё-таки направлюсь к Кею":
                "..."
                "Я зевнул, завернул за угол и побрел к лифту."
                scene bg_nothing with fade
                pause(0.7)
                jump choice2_done
    else:
        scene bg_nothing with fade
        pause(0.7)
        jump choice2_done

label choice2_roof:
    $ flague_roof = 1
    "..."
    "Желание вновь оказаться на крыше оказалось сильнее."
    "Я сел в лифт и поехал на верхний этаж."
    scene bg_outdoor_stairs
    with fade
    "Меня встретила та же лестница и похожий узкий коридор..."
    "Дело в том, что лифт не шел непосредственно на крышу."
    "Чтобы туда попасть, нужно было подняться по ступеням последнего этажа."
    "..."
    "Я медленно шел вверх."
    "Выход на крышу закрывала массивная дверь."
    "Странным было то, что она ни разу на моей памяти не была заперта."
    "Поэтому любой мог спокойно там проводить время."
    "Но самым интересным было то, что кроме меня этой возможностью никто не пользовался."
    "Я поднимался всё выше..."
    "..!"
    "Внезапно услышал нежданный звук."
    "И как только я открыл дверь..."
    scene bg_rooftop_dusk with slowdissolve
    "..?"
    show natali_concerned with fastdissolve
    "..."
    me "\"А-а?\""
    "Невольно вырвалось у меня..."
    show natali_concerned_v2 with fastdissolve
    hide natali_concerned
    "Я немного удивился."
    "Но не стоило это так показывать."
    "Женщина, которую я видел сегодня утром, чуть ли не на секунду остановила на мне свой слегка недовольный и обеспокоенный взгляд."
    hide natali_concerned_v2 with fastdissolve
    "А затем с завидной скоростью, в то же время излучая спокойствие, спустилась по лестнице позади меня и ретировалась."
    "Спустя минуту, лишь стук её каблуков едва доносился до моих ушей."
    "А вскоре и вовсе стих."
    "Я какое-то время торчал на месте и лишь смотрел на происходящее через левое плечо."
    "Хмм...."
    scene bg_outdoor_stairs_gray with fade
    "\"Поэтому любой мог спокойно там проводить время.\""
    "\"Но самым интересным было то, что кроме меня этой возможностью никто не пользовался.\""
    scene bg_rooftop_dusk with fade
    me "\"Как иронично то вышло.\""
    "Похоже, мои ожидания не совсем оправдались."
    "И это уедининое место, где раньше, как предполагалось, я мог спокойно проводить время в одиночестве, уже не смотрелось настолько перспективно..."
    "На крыше не было ничего интересного."
    "Поэтому поначалу меня заинтересовало, что могла здесь делать эта незнакомка."
    "..."
    me "\"Вот оно что...\""
    "Теперь мне всё стало понятно."
    show enji_sorried with fastdissolve
    with Pause(2.5)
    hide enji_sorried with fastdissolve
    "Я сделал вид, будто не заметил её."
    "Я стоял поодаль, устремив свой взгляд в небо."
    "Не думаю, что она не увидела меня."
    "Но по крайней мере, Энджи делала вид, будто её не интересует ничего, кроме одиночества."
    "Я еще раз тайком взглянул на неё."
    show enji_upset with averagedissolve
    "Она точно смотрела куда-то вниз."
    "До этого у неё был виноватый вид, сейчас же она выглядела немного подавленной."
    "Впервые вижу её такой..."
    hide enji_upset with fastdissolve
    "Не думаю, что Энджи пришла бы на крышу просто так."
    "Между ними явно что-то произошло."
    "Это уже не говоря о том, что я вообще никак не могу трактовать действия той незнакомки..."
    "..."
    "Не то, чтобы мне было сильно любопытно."
    "Я с самого начала не собирался ввязываться в разборки, если таковые действительно имели место."
    "К тому же, разговаривать сейчас с Энджи в такой неловкой для неё ситуации было бы глупо."
    "Мало ли, чего можно от неё ожидать..."
    "Я, кстати, был немного удивлен, что она не припомнила мне тот утренний случай в общем зале."
    "Наверное, она не злопамятная."
    "Может, у нее нет настроения."
    "Независимо от причины, мне это на руку."
    "..."
    show enji_thinking with fastdissolve
    "Тишина..."
    "Лишь ветер иногда пролетал, встряхивая её короткие волосы."
    "На секунду мне показалось, что Энджи тут нет, а вижу я призрака или галлюцинацию."
    "Да, настолько было безмятежним это зрелище."
    "Возможно, Энджи, как и я, сейчас приводила мысли в порядок."
    "А ведь если подумать, ей было тяжелее, чем мне."
    hide enji_thinking with slowdissolve
    "Чтобы меня не заклеймили извращенцем, я больше не смотрел в ее сторону."
    "Опершись на перила забора, что окружал всю крышу многоэтажки, я закрыл глаза и решил насладиться свободой еще какое-то время."
    scene bg_nothing with normdissolve
    "..."
    "..."
    "..."
    enj "Скажи..."
    scene bg_rooftop_dusk with slowdissolve
    show enji_speaking_down with averagedissolve
    play music interconnected fadeout 3
    "..?"
    show enji_speaking with averagedissolve
    hide enji_speaking_down
    enj "c чем у тебя ассоциируется высота?"
    show enji_siding with averagedissolve
    hide enji_speaking
    "В её речи и жестах не было ни ноток гордости, ни надменности, ни презрения."
    "Я чувствовал лишь любопытство."
    "И я не мог промолчать:"
    me "\"Никогда об этом не думал, но...\""
    menu:
        "Наверное, это просто красиво.":
            jump choice3_no

        "Мне кажется, вид с большой высоты безграничен. Вызывает и тревогу, и безмятежность.":
            jump choice3_yes
    jump choice3_done

label choice3_no:
    show enji_thinking with averagedissolve
    "Энджи сама на секунду задумалась."
    "Ей двигало любопытство, и мне интересно, получила ли она ответ, который ожидала?"
    show enji_speaking_down with fastdissolve
    hide enji_thinking
    enj "Возможно, это приятно - наслаждаться видом города, будучи полностью отреченным от него."
    enj "А прохладный ветер и мягкие лучи солнца могут сильно продлить удовольствие."
    enj "Хорошо по-настоящему ценить такие минуты спокойствия."
    show enji_siding with fastdissolve
    hide enji_speaking_down
    "В голосе Энджи слышались нотки меланхолии."
    "Эй нравилось то, что она говорила. Но похоже, она вспомнила что-то неприятное для себя."
    "А я так и не понял, смог ли мой ответ чем-либо ей помочь, хотела ли она просить совета, или эта беседа произошла просто так, чтобы развеять неуютное напряжение?"
    "Насколько глубоким был её вопрос?"
    jump choice3_done

label choice3_yes:
    $ enj_p += 1
    show enji_smilling_down with averagedissolve
    pause 0.5
    show enji_siding with fastdissolve
    hide enji_smilling_down
    show enji_usual  with fastdissolve
    "По её мимолетной улыбке я понял, что ей понравился мой искренний ответ."
    "..."
    "Пожалуй я рад, что смог не разочаровать её. Хотя я не планировал ничего такого."
    "Далее Энджи заговорила, будто подводя к немного другой теме."
    show enji_speaking with fastdissolve
    hide enji_usual
    enj "Открывающийся пейзаж действительно может быть разнообразно великолепен: даже самый обыденный вид может впечатлить."
    enj "Но твой ответ показывает, что ты задумывался не только о красоте, не так ли?"

label choice3_done:
    show enji_usual with fastdissolve
    hide enji_speaking
    me "\"Честно, повторюсь, никогда особо об этом не думал. У меня раньше никогда не возникало четких ассоциаций по этому поводу.\""
    show enji_speaking_down with fastdissolve
    hide enji_usual
    enj "Когда смотришь на мир, в котором живешь, возникают и другие мысли..."
    enj "Вид с высоты также может вызвать и противоречивые чувства."
    "Энджи продолжала мыслить вслух, не обращая на меня внимания."
    enj "Можно почувствовать величие, находясь в роли наблюдателя, но и чувство небезопасности."
    enj "Слишком обширный вид поставит тебя в деликатное положение: являясь наблюдателем, ты будешь видеть барьер между собой и миром, но в то же время ты будешь осознавать, что ты всё ещё его часть."
    "?"
    "Чувствуя мое недопонимание, она взглянула на меня."
    show enji_speaking with fastdissolve
    hide enji_speaking_down
    enj "Мир - лишь то, что мы можем ощутить. Ведь у нас нет других способов его воспринимать."
    enj "Разум подсознательно отделяет то, что мы чувствуем, и то, что мы знаем."
    enj "Сейчас реальным для тебя является эта площадка на крыше небоскреба, а всё, что ты видишь далеко внизу, воспринимается как нечто иное."
    enj "Тем более, если речь идет о каком-нибудь другом городе или даже стране."
    enj "То, и другое - мир, в котором ты живешь, но ведь эта площадка кажется тебе более реальной, чем далекий вид с высоты?"
    enj "На самом деле, между ними никакой разницы нет, ведь правильнее осознавать бо́льший, видимый тобой мир, а не только пространство рядом с тобой."
    enj "Но последнее ощущается тебе более реальным. Забавно получается..."
    enj "Вот такие мысли в твоей голове вызывет вид с высоты, замечаешь ты это или нет."
    show enji_siding with fastdissolve
    hide enji_speaking with fastdissolve
    "..."
    "Ни с того ни с сего, Энджи поделилась со мной такими ... понятными мыслями."
    "После её слов, я кое-что осознал."
    "Я делал это для того, чтобы понять такое знакомое странное чувство."
    "Каждый раз, стоя здесь и наблюдая за всем с высоты, я невольно сталкивал свой разум, руководствующийся логикой, и опыт, задетый чувствами..."
    "В отличии от повседневной жизни, где подобный процесс протекает размеренно, здесь, высоко над землей, всё это начинает резко обостряться."
    hide enji_siding with averagedissolve
    "Странно выходит."
    "Я ощущал некоего рода дискомфорт, слушая Энджи."
    "Ибо она говорила о довольно очевидных вещах."
    "Которые можно понять, не прилагая никаких усилий."
    "Но порой..."
    "такие простые вещи трудно заметить."
    "Осознание этого раньше часто приходило ко мне, но в то же время не задерживалось..."
    "Останется ли {i}это{/i} чувство у меня надолго?"
    enj "..."
    stop music fadeout 3
    "Похоже, мой обеспокоенный вид слегка позабавил Энджи."
    show enji_evil_smilling with fastdissolve
    pause 0.4
    hide enji_evil_smilling with averagedissolve
    "Оставляя меня в недоумении, она тихо ушла."
    "Я какое-то время стоял и размышлял о кое-чем более важном:"
    me "\"Был ли это своеобразный способ Энджи отомстить мне за случившееся утром?\""
    jump choice1_done

label choice2_done:
    jump choice1_done

label choice1_done:
    scene bg_head_office_sunset with averagedissolve
    play music lounge fadeout 4
    if flague_roof == 1:
        show key_speaking_kindly with averagedissolve
        key "Ты позднее, чем обычно."
        key "Снова наслаждался видом с крыши?"
        show key_usual_smiles with fastdissolve
        me "\"М-м-м...да. Так уж вышло, что мне пришлось дольше проветриваться.\""
        "..."
        key "Да, по тебе видно."
        hide key_usual_smiles
    show key_speaking_kindly with fastdissolve
    key "Я так понял, что у тебя на сегодня с работой покончено. Всё успел?"
    show key_usual with fastdissolve
    hide key_speaking_kindly
    me "\"Не совсем, кое-что ещё осталось. Вот нужные отчеты, остальное донесу потом.\""
    hide key_usual with fastdissolve
    "Я вытащил из портфеля папки с бумагой, и положил на стол Кея."
    show key_usual_worried with averagedissolve
    key "Работы было действительно много, поэтому я не удивлен, что ты не успел."
    key "Тем не менее, я надеюсь на то, что ты выполнял дело тщательно, и ни у кого не будет неприятностей."
    "Устало подчеркнул Кей."
    "Видимо, у него тоже был нелегкий день."
    if flague_choice1_retard == 1:
        "Интересно, стоит ли ему признаться, что сегодня в обед я немного прохалявил?.."
        "..."
        "Всё же мне бы не хотелось создавать ему проблем."
    else:
        "Мне бы не хотелось создавать ему проблем."
    show key_usual_smiles with fastdissolve
    hide key_usual_worried
    key "Ладно, можешь уже расслабиться. Возвращаться домой нужно с хорошим настроением."
    "После столь формального и делового тона, Кей снова начал вести себя по-дружески, возвещая о конце рабочего дня."
    key "Энджи уже отрапортовала мне ранее,  а Фил заходил час назад. Ты последний."
    key "Раз уж вы все закончили, то мне тоже делать нечего. Я уже побеседовал с ребятами из лаборатории и подчиненными из основного зала, раздал нужные указания."
    key "Поэтому сегодня всё должно закончиться как по маслу."
    "..."
    show key_usual_speaking with fastdissolve
    hide key_usual_smiles
    key "И прежде чем мы завершим, я дам тебе кое-что важное."
    me "\"Неужели?\""
    key "Да, раз уж ты сам не можешь о себе позаботиться, то на этот раз придется сделать это мне."
    me "\"О чем ты?\""
    key "Я про твои частые опоздания."
    key "А вот с этим у тебя должно стать меньше проблем."
    show key_usual with fastdissolve
    hide key_usual_speaking
    "Кей достал из заднего кармана часы и протянул их мне."
    "Но это были именно смарт-часы, а не что-то простое."
    "Я начал вращать их в руках и рассматривать."
    "Вау! Это мне?"
    show key_usual_smiles with fastdissolve
    hide key_usual
    "Каким бы равнодушным я не оставался, Кей смог заметить моё восхищение."
    "Он стоял, и выжидающе улыбался."
    "Часы были идеально гладкими и отдавали серебряным блеском."
    "На нежно-синем глянцевом дисплее в режиме блокировки отображалось текущее время в 24-часовом формате: {i}20:07{/i}"
    "Справа от экрана была небольшая кнопочка."
    show key_speaking_kindly with fastdissolve
    hide key_usual_smiles
    key "Кнопка переведет режим работы часов в голографический. Но для этого тебе сначала придется разблокировать экран."
    key "Так как теперь это лично твоё устройство, с помощью своего отпечатка пальца ты можешь снять блокировку, когда тебе будет угодно."
    key "Как видишь, я уже обо всём позаботился."
    key "Более того, когда будет время, посиди и покопайся в настройках."
    "..."
    key "А, вот что еще: с него спокойно можно звонить и отправлять сообщения. Мой номер там уже записан."
    show key_usual_worried with fastdissolve
    hide key_speaking_kindly
    key "Я знаю, что ты не любишь, когда вмешиваются в твою личную жизнь, и тебе не в радость общаться с кем-то удаленно, но пришло время привыкать..."
    key "К тому же, это один из дополнительных способов наладить твои контакты с Энджи и Филом."
    key "Учитывая, что пора бы вам стать настоящей командой, а не группой людей, лишь имитирующих это понятие."
    show key_usual with fastdissolve
    hide key_usual_worried
    key "Я надеюсь, ты понимаешь меня."
    "Последнюю фразу он произнес довольно серьезно."
    "И не то, чтобы я как-то хотел перечить ему."
    "Даже если бы он был младше меня, его мнение практически по-любому поводу куда авторитетней, чем я могу себе представить."
    "В любом случае, я собирался искренне поблагодарить его за столь щедрый подар-"
    show key_usual_smiles with fastdissolve
    hide key_usual
    key "Вычту из твоей зарплаты (´.• ω •.`)"
    "Ха-а-а?"
    "Я тихо и нервно сглотнул."
    "Ну, да, конечно..."
    key "А ты думал, это за прото так?"
    key "Вообще-то, тебе следовало купить нечто подобное уже давно, так что не благодари меня."
    "Э-э-эмм..."
    "Я горько усмехнулся."
    "Похоже, надо было купить обычный телефон или что-то подобное."
    "А так, похоже, я сам себя загнал в яму."
    "Думаю, не стоит даже думать о том, сколько на самом деле стоят такие часы."
    "И в этом месяце я уже точно останусь без зарплаты. В худшем случае - ещё и дополнительно придется отрабатывать."
    "Я прищурил глаза и начал сверлить этот дьявольский подарок."
    "..."
    "А ведь отказаться я уже никак не мог..."
    "..."
    "Кей, кажется, понял моё положение."
    show key_speaking_kindly with fastdissolve
    hide key_usual_smiles
    key "Не переживай!"
    key "Я сделал тебе большую скидку. К тому же, такое устройство сейчас есть буквально у единиц."
    key "А я уверен, что скоро оно станет хитовым брендом в высших слоях общества. Да-да, когда придет его время..."
    show key_usual with fastdissolve
    hide key_speaking_kindly
    "Что ж ... похоже у меня нет выбора."
    "Киваю в знак согласия, скрывая своё негодование."
    "Я переворачиваю часы на обратную сторону и вижу логотип кампании H-Dep в виде двух огибающих друг друга стрелок."
    "Кею явно нравятся всякие гаджеты, и поэтому я решил узнать еще кое-что."
    me "\"Я так понимаю, что это благодаря связям в лаборатории?\""
    show key_speaking_kindly with fastdissolve
    hide key_usual
    key "Именно. Я ведь также руковожу здешним отделом разработки, который непосредственно работает на XiJ в условиях временного взаимовыгодного контракта."
    key "Это именно ребята, взращенные H-Dep, а не государством и кампанией XiJ."
    key "Благодаря моему влиянию и небольшой прихоти, правилам эксплуатации и дыркам в контракте, мы смогли уделить время на то, что видишь."
    show key_usual_worried with fastdissolve
    hide key_speaking_kindly
    key "По-моему, вышло неплохо, хотя в следующий раз мне нужно быть осмотрительнее."
    me "\"Ладно, я понял.\""
    "Я мягко прервал его, пока он не погрузил меня в пучину своих деловых мыслей, причем не слишком радостных..."
    show key_usual_speaking with fastdissolve
    hide key_usual_worried
    key "В любом случае, доверие к H-Dep и её эффективность никогда не падали. И я, именем своей семьи, всеми силами не допущу этого."
    key "Итак, пока не будем об этом."
    show key_speaking_kindly with fastdissolve
    hide key_usual_speaking
    "Он снова стал самим собой."
    key "У меня есть одно предложение. Воспринимай его чисто как дружеское. К работе почти отношения не имеет."
    key "Не желаешь ли ты остановиться в городе на недельку-другую?"
    show key_usual_smiles with fastdissolve
    hide key_speaking_kindly
    "Если честно, я ожидал чего-то подобного."
    "С одной стороны это было гарантией для Кея, что я стану относиться ко всему серьезнее, то есть без моей привычной апатии."
    "Также, возможно, он просто заботился о том, чтобы мне нужно было меньше напрягаться утром и вечером, раньше отправляясь на работу и, соответственно, возвращаясь домой."
    "А ещё, ходили слухи: вроде этот месяц обещает быть особо трудным."
    "..."
    "Мне сложно увидеть что-то ещё в его предложении."
    "Но даже если я соглашусь, то где остановлюсь, и сколько это будет стоить?"
    "И будто читая мои мысли-"
    show key_speaking_kindly with fastdissolve
    hide key_usual_smiles
    key "На этот раз подвоха нет. У меня есть хорошая комната в приличном отеле, которую я снимаю каждый месяц."
    key "Дело в том, что я сам редко там бываю, так как обычно у меня много дел за пределами офиса. И возвращаться мне ближе домой."
    key "Так что платить тебе не придется. Всё за мой счет!"
    key "Более того, я собирался предложить тебе нечто подобное уже давно."
    show key_usual_smiles with fastdissolve
    hide key_speaking_kindly
    "Заманчивое предложение, однако."
    "Возможно, жизнь в городе пойдет мне на пользу, хотя я не так давно сбежал от родителей."
    "..."
    "Впрочем, они живут далеко, и меня точно не найдут."
    "К тому же, мне понравилась мысль {i}бесплатно жить{/i} в роскошном номере и пользоваться его благами."
    "По сути, это будет означать, что я нахлебник, чего и пытался ранее избегать."
    show key_usual with fastdissolve
    hide key_usual_smiles
    "Я попытался отделаться от этой мысли как можно скорее, но неприятное послевкусие дало о себе знать."
    "Кей сказал, что на этот раз никакого подвоха нет."
    "Но он ведь есть!"
    "Если я остаюсь в этом месяце без зарплаты, мне еле-еле хватит на квартплату моего дома."
    "А значит, если я откажусь и вернусь туда, то могу помереть с голоду."
    "..."
    "Сегодняшний день был вычеркнут мною из категории \"один из приятных\"."
    show key_usual_speaking with fastdissolve
    hide key_usual
    key "Так что ты решил?"
    show key_usual with fastdissolve
    hide key_usual_speaking
    me "\"Я не откажусь.\""
    show key_usual_speaking with fastdissolve
    hide key_usual
    key "Тогда самое время выдвигаться."
    hide key_usual_speaking with averagedissolve
    if flague_phil_proposition == 1:
        "И тут я кое-что вспомнил."
        me "\"Постой!\""
        show key_usual with averagedissolve
        me "\"Мне сегодня довелось поговорить с Филом. Не обижайся, что раньше не сказал. Дело в том, что он пригласил меня к себе, и я принял его предложение.\""
        me "\"Я просто только сейчас вспомнил об этом маленьком обещании.\""
        show key_speaking_kindly with averagedissolve
        hide key_usual
        key "Всё в порядке. Может, так даже лучше. Как выйдем на парковку, я позвоню Филу, и мы согласуем, стоит ли завозить тебя к нему сегодня."
        hide key_speaking_kindly with fastdissolve
    stop music fadeout 3
    "Он больше ничего не сказал и покинул кабинет."
    "Я последовал за ним."
    scene bg_nothing with fade
    "Таким образом, ко мне вернулась шумная городская жизнь."
    "Казалось бы, когда я уже от неё отвык."
    "Жизнь течет размеренно, и большую её часть я провожу на работе, поэтому я не сильно должен заметить смену обстановки."
    if flague_phil_proposition == 0:
        "Хоть и выбора особо не было..."
    "Но, возможно, принятое решение ознаменует начало новых нежелательных приключений..."

    jump chapter1
