label prologue_office_roof_enji_answer_false:

    show enji thinking
    with averagedissolve

    "Энджи сама на секунду задумалась."
    "Ей двигало любопытство, и мне интересно, получила ли она ответ, который ожидала?"

    show enji speaking down
    with fastdissolve

    enji "Возможно, это приятно - наслаждаться видом города, будучи полностью отреченным от него."
    enji "А прохладный ветер и мягкие лучи солнца могут сильно продлить удовольствие."
    enji "Хорошо по-настоящему ценить такие минуты спокойствия."

    show enji siding
    with fastdissolve

    "В голосе Энджи слышались нотки меланхолии."
    "Эй нравилось то, что она говорила. Но, похоже, она вспомнила что-то неприятное для себя."
    "А я так и не понял, смог ли мой ответ чем-либо ей помочь, хотела ли она просить совета, или эта беседа произошла просто так, чтобы развеять неуютное напряжение?"
    "Насколько глубоким был её вопрос?"

    jump prologue_office_roof_after_answer
