label prologue_office_work:

    "..."
    "Что ж, быстрее начну - быстрее закончу."
    "Ощущая утомительную тяжесть в теле, я снова приступил к делу."
    "Уже работалось не так легко, как в первой половине дня, поэтому иногда я начинал ошибаться."
    "Время от времени хотелось пить, поэтому я наливал воду из экстрактора в пластиковый стакан."
    "Жарко не было, к тому же был включен кондиционер, но всё-таки я немного вспотел."
    "..."
    "..."

    scene bg office main_character workroom evening
    with fade

    me "\"Что ж, сегодня я управился быстрее, чем ожидалось.\""

    "Похоже, не брать перерыв было хорошей идеей."
    "Но если потом окажется, что я где-то ошибся, мне стоит ждать нагоняй, в худшем случае, от всего отдела..."

    jump prologue_office_choose_ending
