label chapter_1_district_the_walk:

    # Глава 1: День - Прогулка
    # Chapter 1: Day - The Walk

    scene bg_sleep_district_morning with slowdissolve
    pause(2.0)

    "Какое прекрасное утро!"
    "Я решил избавиться от похмелья благодатной прогулкой."
    "В надежде на то, что воспоминания предыдущего дня вернутся."
    "..."
    "Я топал по дороге спального района, за моей спиной возвышалось здание корпорации, в которой я работаю."
    "Так как до этого я не бывал в этих местах, всё казалось мне довольно незнакомым."
    "Несмотря на то, что утро было субботним, я часто натыкался на прохожих, а один раз умудрился невнимательно перейти дорогу в неположенном месте."
    "Так уж случилось, что на дороге меня окликнул какой-то дядька. Я тут же остановился, а через секунду мимо меня пронеслась машина и завернула в какой-то переход."
    "А еще во время моей прогулки я, завернув в очередной угол, случайно столкнул какую-то женщину."
    "Эххх..."
    "Вспонимая утро прошедшего дня, я никак не мог не сравнить шум и суету спального района мегаполиса и спокойствие моего дома."
    "Но жизнь в большом городе всегда требует темпа и сосредоточенности."
    "Отчего даже гуляя по улицам, изматываешься быстрее."

    me "Ничего, я скоро привыкну."

    "..."
    "Я достаточно далеко ушел к югу от дома Фила. Здание корпорации всё еще величественно возвышалось на горизонте."
    "Чтобы не всегда идти по главной дороге и в одном и том же направлении, я начал петлять по улочкам."
    "Неизвестное манило меня."
    # Пояснение об использовании тегов: https://www.renpy.org/doc/html/text.html
    "Или из-за того, что похмелье еще не прошло, я был более {w=0.8}...азартным?"

    scene bg_vending_machine with slowdissolve
    pause(1.5)

    me "Фух..."

    "Кажется, я немного запыхался."
    "Достаточно побродив в окрестностях, и, чувствуя небольшое утомление, я случайнно обнаружил себя во дворе."
    "Я направился в западную его часть и увидел крытое строение из лакированного дерева, где можно было передохнуть."
    "Я не помню, когда сегодня проснулся, но я нащупал в своем кармане часы, что подарил мне Кей. По двадцати четырех часовому формату времени сейчас было 14:01."
    "Я оперся об стену и присел на плитку. Во дворе кроме деревьев и клумб ничего не было, даже ни намека на лавочку."
    "Поэтому пришлось выбирать более удобное место дальше по списку... Внутри также не было никаких специальных мест для сидения."
    "..."

    scene bg_nothing with fade
    pause(0.5)

    "Редкий ветерок, иногда посещавший этот двор, слегка трепетал мои волосы."
    "Вдалеке я слышал легкий шум улиц спального района."
    "Я посидел в таком состоянии несколько минут, и, открывая глаза,"

    scene bg_vending_machine with slowdissolve
    pause(0.5)

    "заметил, что похмелье, благодаря проведенному времени на улице, немного выветрилось."
    "..."
    "Я не собирался дальше идти в западную часть двора. Всё, что я могу увидеть, сидя на плитке крытого здания, так это часть магазинчика, выглядывающего из-за угла слева..."
    "... и напоминающий мне тип магазинов с заправки."
    "Справа от него шел высокий кирпичный забор, а за ним виднелся недостроенный трехэтажный панельный дом."
    "Сам я уставился прямо на торговые автоматы, которые, к моему облегчению, не продавали алкогольные напитки."
    "Посидев немного, я решил что-нибудь купить, чтобы промочить горло, да и захотелось почувстовать какой-то вкус жизни."
    "Или лишь его имитацию... Сейчас я был в настроении получить простое короткосрочное наслаждение."
    "Подойдя к нужному автомату и прикинув, что я хочу приобрести, я стал шарить по своим карманам."
    "Я отправился на прогулку в своей универсальной ветровке. У неё был карман с застежкой у левой части груди, и по два обычных кармана ниже. Также был внутренний карман куртки."
    "В тех случаях, когда я ходил без своего портфеля, я обычно хранил важные вещи в верхних карманах. Так что те же смарт часы я взял с собой."

    me "Неужели я не взял с собой..?"

    "Карточку."
    "Я искал свою банковскую карточку, так как налички у меня не было. А ведь все торговые автоматы позволяют платить электронными деньгами."

    me "Есть!"

    "Проверив карманы своих штанов, я достал небольшой футляр, в котором хранились мой код-индикатор и банковская карта."
    "Выбрав напиток с помощью электронного меню, и прислонив чип карточки к устройству на торговом автомате, я услышал звук списывания средств."
    "Амбивалетное чувство, на самом деле..."
    "Чтобы в тот же момент увидеть на терминале автомата фразу \"Недостаточно средств!\" и последовавший за ней соответствующий сигнал."
    "{w=0.9}(•_•)"
    "Наверное, та карточка, которую я взял с собой, как раз-таки и была карточкой, предназначенной для покупки всякой мелочевки."
    "Но мне периодически нужно переводить средства сюда с зарплатной карты. И то, что они выглядят очень схоже, иногда сбивает с толку..."
    "Больше с собой у меня ничего не было, и просить деньги у прохожих ради удовлетворения своего маленького желания я точно не буду."
    "И всё нужное мне сейчас лежало среди вещей дома у Фила..."
    "Как только я собирался уйти, мой взгляд упал на кармашек другого близстоящего автомата."
    "В котором я увидел другой напиток - кажется, подслащенную воду с цитрусовым привкусом."
    "Странно, что я не заметил её до этого, но с той стороны, с которой я подошел к торговым автоматам, было бы затруднительно заметить что-то в этом кармашке."
    "Учитывая, что кармашек сам по себе глубокий..."
    "Возможно, что от полированного металла отразился свет, а дальше вода в пластиковой бутылке тажке частично отсветила его, и луч слегка задел мой глаз."
    "..."
    "Я немедленно подошел и взял воду."

    me "Ну хоть уже что-то."

    jump chapter_1_waterbottle_stranger


label chapter_1_waterbottle_stranger:

    "И в тот момент, когда я задумался, а чья же это вода ..."

    $ unknown.who_args["color"] = color="#FFE4E1"

    unknown "Э ̄ то ... "
    unknown "Прошу прощения, но не могли бы вы отдать мне мою воду..?"

    "Я услышал мягкий, но слегка обеспокоенный голос."
    "И я замер, призадумавшись."
    "Первая фраза, которая я услышал, скорее всего прозвучала на общевосточном."
    "Не то чтобы я не понимал, что она означала, ведь это было междометие. К тому же, все ученики в школе учат три основных мировых языка, один из которых - общевосточный."
    "Я медленно повернулся к неожиданному собеседнику, пытаясь смастерить улыбку на лице."

    show sae_unf_confused at center
    with slowdissolve

    me "Так это вы оставили воду, простите."

    "Как только она попыталась заговорить..."

    show sae_unf_badly_surprised with averagedissolve
    hide sae_unf_confused
    show sae_unf_confused_speaking with averagedissolve

    hide sae_unf_confused
    show sae_unf_confused with averagedissolve

    hide sae_unf_confused_speaking
    show sae_unf_badly_surprised with averagedissolve

    hide sae_unf_confused

    "На её милом лице отразилась смесь разнообразных эмоций, отчего я сам пришел в замешательство."
    "Однако спустя секунду"

    hide sae_unf_badly_surprised superfastdissolve

    "с завидной скоростью для такой малышки,"
    "она выхватила бутылку с водой из моей раслабленной руки"
    "и унеслась прочь, что-то промямлив себе под нос."
    "И всё, что я успел сделать, так это сдвинуть ногу и лишь слегка протянуть руку в направлении стремительно удаляющегося силуэта."
    "С крытой постройки, где находились торговые автоматы, она выбежала на другую сторону двора, где в лучах дневного солнца нагревались бетонные плиты недостроенного здания."
    "Как только она завернула за угол, я перестал думать о том, чтобы последовать за ней."
    "Всё, что я напоследок смог увидеть, так это {w=1}её нижнее белье под юбкой, приподнятой то ли внезапным порывом ветра, то ли её скоростью бега..."

    jump chapter_1_call_to_key


label chapter_1_call_to_key:

    "..."
    "Как неловко вышло."
    "Я её впервые вижу, и не заслужил такого отношения к себе."
    "Может быть, она трусиха и испугалась общения с незнакомым человеком?"
    "Или я как-то странно выгляжу..?"
    "Да и вообще, может эта бутылка с водой и не была её собственностью, и всё, что я сейчас лицезрел - лишь представление мелкой хулиганки?"
    "Нежелая больше об этом думать, я резко провел ладонью по лбу, взъерошив челку, чтобы собраться с мыслями."
    "Мне сильно хотелось выпить что-нибудь сладенького и холодненького."
    "И тогда мне в голову пришла одна идея."
    "Я достал смарт часы, прикрепил их себе на левую руку."
    "Разблокировал экран с помощью проверки отпечатка пальца."
    "Вывел режим отображения экрана в голографический."
    "Перед моим лицом вспыхнула приятная глазу бледно-синяя картинка."
    "Я проверил, есть ли мобильная связь."

    me "Хорошо, что счёт оплачен."

    "Зашел в список контактов, увидел там лишь один номер, и позвонил."
    "..."
    "..."
    "..."

    key "Приятно тебя слышать, но я сейчас занят, поэтому говори быстрее."

    me "Я сейчас отправлю сообщение, в котором будет содержаться сумма и номер моей карты. Думаю, ты понял, что..."

    key "Без проблем. Но потом вернешь. До связи."

    me "Конечно."

    "Не успел я договорить, как звонок завершился."
    "Последняя  его фраза прозвучала довольно резко, но не то чтобы он злился - скорее был напряжен."
    "Это был единственный человек, которого я не стеснялся просить помощи."
    "А в данной ситуации на кого-то другого тем более невозможно было положиться."
    "Я постоял пару минут, ожидая, когда Кей отправит на мою карточку немного денег."
    "Способа проверить, пришла ли сумма или нет, у меня не было, так как я еще не особо разбирался с функционалом смарт часов и к тому же сейчас не имел доступа к электронному кабинету банка."
    "Кей явно был занят, поэтому вряд ли напишет в ответ или тем более перезвонит."
    "Но зная то, как Кей быстро решает всякие мелочи, я был вполне уверен в успехе моей задумки."

    jump chapter_1_soda_drinking


label chapter_1_soda_drinking:

    "И через пару минут мои надежды оправдались: я потягивал вкусную газировочку, продолжая свою прогулку по улицам."

    scene bg_sleep_district_day with averagedissolve
    pause(0.5)

    "Тем не менее, газировка не могла улучшить моё дурное настроение."
    "Голова болела, пускай не так сильно, как раньше, и не все симптомы похмелья прошли."
    "Набравшись сил, я какое-то время бродил по району. Даже нашел неплохое место, где можно перекусить."
    "Вскоре я пришел к выводу, что пора возвращаться."
    "..."
    "Я петлял по незнакомым улицам, стараясь найти дорогу назад. Точного адреса дома Фила я не помню, но пытался возвращаться по памяти."
    "Я был все еще слегка дезориентированным и чувствовал слабость в теле."
    "И зря я раньше надеялся, что это пройдет к вечеру."
    "На часах сейчас было шесть минут пятого."
    "Я не решался спрашивать у прохожих дорогу, ведь верил, что не ошибся в выборе направления."
    "..."
    "Это ведь та самая улица, правильно?"
    "Чем больше я ходил, тем больше во мне просыпалось сомнений."
    "В основном я ориентировался по большому зданию корпорации - сейчас оно было ближе, чем раньше, но это не удивительно, ведь сегодня утром я отправился на юг."
    "А сейчас иду в противоположном направлении."
    "Несмотря на то, что у меня не было никаких проблем с запоминанием местности, я всё же с трудом находил обратную дорогу, ведь спальный район был усеян похожими друг на друга двуэтажными домишками."
    "Также на это влияло то, что я сегодня довольно много куда заворачивал, тем самым усложняя себе маршрут."
    "Я решил оглядеться, и внезапно в моё поле зрения попало кое-что знакомое."

    jump chapter_1_district_enji_meeting


label chapter_1_district_enji_meeting:

    show enji_siding with averagedissolve
    pause(0.5)

    hide enji_siding with slowdissolve
    pause(0.3)

    scene bg_sleep_district_day with fade
    pause(0.5)

    "Это ведь была Энджи? На пару секунд мне привиделась знакомая фигура, которая скрылась за придорожной клумбой и вскоре исчезла за углом другой улицы."
    "Во мне разыгралось нешуточное любопытство. Что же она тут делает?"
    "Хотя я всё еще не пришел в себя, и наверное, лучше бы следовало вернуться домой пораньше и извиниться перед Филом за то, что я погарячился..."
    "И тогда я решил-"

    menu:
        "Проследить за Энджи":
            jump chapter_1_follow_enji

        "Вернуться домой":
            jump chapter_1_return_home
