label prologue_constructions:
    # Сюжетная стена, которую Кирилл собирался добавить позже

    scene bg_constructions
    with slowdissolve
    pause 0.5

    "Шло время..."
    "Огромные финансовые сбережения и сохранившаяся техника CC, а также множество хорошо обученных специалистов,
    в ряды которых уже вошёл персонал организации XiJ, позволили быстро отстроить города и наладить производство."
    "Благодаря продолжительному исследованию нового элемента, инженерам и ученым наконец-то удалось применить его в деле."
    "Отчасти обуздав новый элемент, исследователи начали разрабатывать новые необходимые технологии..."
    "Первыми устройствами были специальные аккумуляторы, способные хранить выделяемую энергию XiJ."
    "Стартовали разработки внедрения полученных результатов в сферу транспорта, а также автоматизации всего, чего только возможно."
    "Энергия XiJ, даже при малых её количествах, была гораздо эффективнее всех других известных источников."
    "Там, куда внедряли новые разработки, КПД рос на глазах."
    "Двигатели на новой энергии стали успешно применяться, в первую очередь, на железных дорогах."
    "Ибо из элемента XiJ было проще всего синтезировать что-то наподобие электричества..."
    "Постепенно, новый элемент начал вытеснять остальные источники энергии."
    "Он не смог заменить их полностью, но, наверное, уже восемьдесят процентов современной техники, используют энергию, синтезированную на XiJ."
    "Сейчас ведутся разработки внедрения новых двигателей в автотранспорт, морские суда, а также в технику, связанной с воздушным пространством и космосом."
    "Пока что, особого успеха в этом деле организация CC не достигла из-за недостатка финансов, поэтому проекты временно переведены в стазисный режим."
    "..."

    jump prologue_constructions_nothing


label prologue_constructions_nothing:

    scene bg_nothing
    with slowdissolve
    pause 0.5

    "Возвращаясь к прошлому..."
    "Влияние и авторитет CC стали всемирно неоспоримы, и дело дошло до переговоров - "
    "когда оставшиеся после войны крупные страны решали вопросы политики."
    "Так как CC внесла огромный вклад в восстановление мира, она могла диктовать свои условия."
    "Условия Организации оказались ошеломительными, хотя сейчас, все стали понимать, что тогдашнее решение CC, возможно, было правильным."
    "CC предложило упразднить системы государств, народностей, и всего, что могло сильно разъединить людей."
    "Взамен этому будет создана единая структура под названием \"Сеть\"."
    "Этот единый огранизм, по мнению Организации, мог бы расти и развиваться под их присмотром до тех пор, пока это было нужно..."
    "Лидеры присоединившихся к \"Сети\" стран получили бы высокие должности на руководящих постах..."
    "Выбора не было."
    "Точнее был, но и без намёков было понятно, что тех, кто отвергнет предложение СС, ждало бы исчезновение."
    "Оставшиеся ресурсы мира были в руках у этой организации, в то время как остальные страны, еле-еле пережив войну,"
    "не имели шансов на дальнейшее самостоятельное существование..."
    "Те, кто стал частью \"Сети\", выжили."
    "CC безжалостно отнеслась к тем, кто отверг её предложение, и оставила их на произвол судьбы."
    "Однако она поощряла своих новых союзников, языки крупных мировых стран стали государственными языками Системы Нового Порядка."
    "Но понятие \"народностей\" исчезло, ибо теперь все вступившие были под контролем Организации."
    "Наконец люди получили спокойствие, и смогли продолжать восстановление мира."
    "Теперь слово \"Мир\" являлось синонимом слову \"Сеть\", ибо теперь все жили под надзором СС."
    "Но, ожидаемая многими, тирания со стороны новых лидеров так и не появилась."
    "И не возникало никаких больших конфликтов."
    "Правительство поощряло создание мелкого бизнеса и предпринимательства."
    "Защищая интересы пролетариата, оно не позволяло создавать корпорации и монополии."
    "А в том случае, когда это происходило, занималось децентрализацией и разделением на мелкие структуры."
    "Никто не был исключением, даже сами государственные органы."
    "Количество скептиков уменьшалось пропорционально тому, как рос уровень жизни."
    "Так как от войны пострадала далеко не вся планета, сохранилось множество пригодных для жизни мест."
    "Большинство из этих мест, как оказалось, вообще не затронуло пламя войны."
    "Об энергокризисе все стали потихоньку забывать."
    "Сеть работала, по мнению СС, \"должным образом\"."
    "Само устройство новой жизни напоминало то, как работают компьютеры в одной среде."
    "Узлами Сети выступали большие города, которые имели собственные кодовые названия."
    "Первым жителям эти названия казались бессмысленными, но СС твёрдо продолжал стоять на своём."
    "\"Мы строим Новый Мир, поэтому мы должны отказаться от старых имён.\" "
    "Это было одно из первых провозглашений СС."
    "Поэтому СС стали называть вещи так, как им было угодно."
    "Через несколько поколений все смирились, а современной молодёжи, как, впрочем, и мне, было абсолютно всё равно..."
    "Узлы сети представляли из себя окружности. Центром круга был сам Узел, близлежащие к нему земли делились на сектора и малые сектора."
    "Моя деревня как раз распологается в одном из таких."
    "..."

    jump prologue_constructions_random_city


label prologue_constructions_random_city:

    scene bg_random_city
    with slowdissolve
    pause 0.5

    "Территориально Узлы были гигантскими, ведь кроме мегаполиса и окружающих его земель, большинство из которых даже не были заселены,"
    "были ещё административные центры, которые так и назывались - \"Командные Центры\"."
    "В этих местах агенты Организации контролируют деятельность Узлов."
    "Командные Центры распологаются в середине каждого Узла и носят его имя."
    "Например, Командный Центр мегаполиса, в который я еду, называется \"CC - FYTLu#324\"."
    "..."
    "На данный момент, всего построено 5 Узлов Межпланетной Сети."
    "Я живу в секторе самого южного из них."
    "Между собой узлы соеденены физическими каналами."
    "Канал - это целый комплекс связи, а также того, что может потребоваться при взаимодействии Узлов."
    "Рядом с каждым каналом проходит массивная железная дорога, что, по сути, является единственным и самым эффективным способом передвижения вне Узлов,"
    "учитывая тщательность построения укреплённых станций, путей, тоннелей и мостов."
    "И также это единственный способ попасть из дальних уголков Узла в его центр..."
    "Есть объекты, которые считаются вспомогательными частями Сети."
    "Они не обязательны для её основной работы, но могут иметь важное значение."
    "Например, шахты добычи XiJ или некоторые контрольные форпосты CC."
    "Технология добычи необходимого элемента XiJ очень сложна, и до сих пор учёные ищут более эффективный способ его извлечения из глубоких недр..."
    "Первого обнаруженного на планете в послевоенное время XiJ хватало на очень долгое время, но даже этот ресурс может исчерпать себя."
    "Когда нашлись новые источники этого элемента, были немедленно выделены ресурсы для постройки шахт, глубина которых могла достигать сотни километров."
    "Так как ранее человечество не знало, что это за элемент и как его добывать, СС до сих пор не может организовать стабильную добычу."
    "Но, по прогнозам аналитиков, уже добытого XiJ ещё хватит, по меньшей мере, на пару сотен лет."
    "Трудность добывания этого элемента заканчивается не только проблемой бурения планеты,"
    "а также того, что элемент не полностью изучен, отчего есть риск получить непредвиденного рода аномалии, если добывать его в чистом виде..."
    "Также, последствия добычи очень сильно портят окружающую среду, и неудивительно, что местность вокруг шахт выглядит как бесплодная пустыня..."
    "Поэтому все Узлы Сети расположены далеко от мест добычи."
    "И открывать новые шахты на территории жилых Узлов строго запрещено."
    "..."
    "Когда Организация CC придумала Сеть, она создала высший орган власти, который назвали Верховный Комитет."
    "К тому времени, старые управляющие организации ушли в отставку, оставив на своём месте новую перспективную элиту,"
    "что справилась бы со своими обязанностями не хуже предшественников."
    "Первые управляющие, что после войны принялись ставить мир на ноги, именовались просто СС или ССv00."
    "Следующее поколение стало называться \"Верховный Комитет CCv01...\" "
    "..."
    "Сейчас уже третье поколение элиты руководит Сетью."
    "Планы и политика Организации, несмотря на очередную смену поколений, практически не поменялись."
    "Единтвенной целью комитета ССv03, судя по тому, что они официально заявили, является благоустройство новой системы."
    "Все предшествующие лидеры также придерживались этого плана и укрепляли свою власть."
    "Почему-то сейчас политика консерватизма работает как нельзя лучше, но если что-то пойдёт не так,"
    "то Организация моментально отреагирует и сменит стратегию."
    "Вот уже 5 лет действует комитет CCv03, и в целом, как говорят, жизнь людей внутри созданной \"Сети\" протекает также тихо и мирно, как это было раньше..."
    "Сейчас две важнейшие структуры, такие как исследовательская организация \"XiJ\" и Центральный Орден Безопасности(COS),"
    "которые действуют от лица CC, имеют множество дочерних компаний, и, таким образом, осуществляют контроль"
    "практически всего, что происходит внутри Сети."
