label prologue_street_sunrise:
    # Пролог: Утро - Улицы.
    # Prologue: Morning - Streets.

    scene bg sky sunrise with slowdissolve
    pause 0.7
    play music november fadeout 2

    "К тому времени, когда я вышел на улицу, светлее не стало."
    "Набежавшие тучи заслонили утренний свет."
    "От дома я свернул налево и прошёл несколько жилых кварталов."

    scene bg street v1 sunrise with slowdissolve
    pause 0.7

    "Вскоре я вышел на небольшой перекрёсток."
    "На небе кое - где еще виднелись звёзды..."
    "..."
    "Я продолжал идти по тротуару."
    "Город спал."
    "Лишь изредка я мог услышать голоса сонных людей, спешивших на работу,"
    "а также шум колёс машин, проезжающих по соседним улицам."
    "..."
    "Пройдя несколько похожих друг на друга улиц, я свернул в следующий спальный район."

    jump prologue_street_1_sunrise


label prologue_street_1_sunrise:

    scene bg street v2 sunrise with slowdissolve
    pause 1

    "..."

    jump prologue_street_2_sunrise


label prologue_street_2_sunrise:

    scene bg street v3 sunrise with slowdissolve
    pause 1

    "Оставив позади одну улицу, я свернул налево."
    "Спустя ещё два квартала, я добрался до центральной улицы города."
    "Вообще, как я недавно выяснил, даже без знания основных маршрутов и местности, по этой дороге можно было попасть куда угодно."
    "Такое возможно только благодаря её удобному расположению."
    "А лично мне нужно как можно скорее попасть на станцию..."
    "По моим догадкам, времени на то, чтобы добраться от моего дома к электричке по самому короткому пути, используя центральную улицу, необходимо около тридцати минут."
    "Но я никак не мог отделаться от мысли, что я уже иду дольше предполагаемого времени."
    "Я ускорился, чуть ли не начав бежать."
    "..."
    "Вообще, я мог бы словить автобус."
    "Или вызвать такси."
    "Но так уж вышло, что я любил ходить до станции пешком."
    "Осталось пройти один перекресток по основной улице, а затем свернуть в парк."
    "Возможно, у меня есть меньше времени, чем я думал."

    me " \"Да, трудно жить без часов под рукой...\" "
    me " \" От своей перманетной лени и некомпетентности в некоторых вещах, иногда даже я устаю.\""

    "..."
    "Пока я двигался к намеченной цели, мысли снова заняли мою голову."
    "Я стал вспоминать как и события недавних дней, так и многих лет назад."
    "Как год назад, я, разочаровав родителей, решил переехать к дяде и тетё в деревенскую глубинку."
    "Хотя место, в котором я живу, трудно сейчас назвать деревней, ибо многое здесь изменилось с тех пор, как я был ещё мал..."
    "Но по сравнению с тем местом, куда я собираюсь ехать..."

    me " \"Я определённо живу в деревне...\" "

    "Умудрился я на бегу ухмыльнуться."
    "Центральная улица была довольно широкой и длинной."
    "Мне нужно было ещё немного попотеть, чтобы добраться до намеченного перекрёстка."

    jump prologue_street_3_sunrise


label prologue_street_3_sunrise:

    scene bg street v4 sunrise with slowdissolve
    pause 1

    "..."
    "Мои родители были всегда строги ко мне."
    "Но также часто давали мне поблажки."
    "Возможно, начав новую жизнь, я изменю прежнего себя."
    "И не буду позором в их глазах."
    "Мне требовалось лишь немного усилий, чтобы убедить их отпустить меня."
    "Я пообещал им, что буду учиться и ездить в университет отсюда."
    "И не то, чтобы я обманул их..."
    "Я просто нашел работу, поэтому перевёлся на заочное."
    "..."
    "Сколько себя помню, моих родителей всегда интересовало только финансовое состояние семьи."
    "Они были профессионалами своего дела."
    "Постоянно занимались разного рода бизнесом, но меня всегда поражало, что денег это приносило достаточно."
    "По крайней мере, я не мог отказать себе во многих вещах."
    "Папа и мама не были плохими. Как и все родители, они просто пытались научить меня тому, что и сами знают."
    "Но мне этого никогда не хотелось. Я считал, что там, где деньги, недалеко обман, махинации, а возможно, и криминал."
    "Я решил отдалиться от этого."
    "Поэтому я сам выбрал университет. Я решил, по крайней мере, прикрыться тем, что учусь делу, чтобы меня больше не донимали."
    "Но потом, я бросил и учебу."
    "Я понял, что стал заниматься тем, что не приносит мне счастья."
    "В итоге, я закрылся от всего..."
    "Возможно сейчас, в очередной раз опаздывая на работу, я жалею о том, что не прислушался к их советам."
    "Я думал, что сам смогу без проблем зарабатывать на жизнь, однако сейчас у меня мало денег."
    "Мне нечему гордиться и радоваться."
    "А мои детские дни, когда я беззаботно играл с дядей и тётой, давно позади..."

    jump prologue_park_sunrise


label prologue_park_sunrise:

    scene bg park sunrise with slowdissolve
    pause 0.8

    "Фух..."
    "Запыхавшись, я добежал до парка."
    "Я остановился передохнуть, а затем зашагал в сторону станции."
    "От парка до неё - рукой подать."
    "Электричка приедет ровно в 6:45."
    "Я уверен, что успеваю."
    "Поезда в центр ходят круглосуточно, но с разным интервалом."
    "Например, предыдущий рейс, отбывает с этой станции ровно в 5:30."
    "Если бы я потрудился встать в пол пятого утра, то приехал бы на работу не только вовремя, а ещё и с большим запасом."
    "Тогда я бы произвел впечатление хорошего работника, а некоторые личности перестали бы на меня косо смотреть..."
    "Мало того, я бы мог спокойно приготовить всё, что нужно для рабочего процесса, уже в офисе, просто попросив разрешения у работодателя."
    "..."
    "Вскоре я взошёл на платформу."

    jump prologue_station


label prologue_station:

    scene bg station sunrise with slowdissolve
    pause 0.4

    "!"
    "Поезд уже был на станции!"
    "И судя по тому, что я вижу, он вот-вот начнёт движение."
    "Я кинулся в ближайший вагон."

    stop music fadeout 3

    jump prologue_train_hall
