label prologue_train_hall:

    # Пролог: Утро - Поездка в город.
    # Prologue: Morning - The way to city.

    scene bg train v1 hall with slowdissolve

    "..."
    "Прошло больше получаса с момента моей посадки."
    "Ранее, когда я вошел в вагон поезда, оказавшегося, на удивление, пустым, я взглянул на дисплей, где показывалось текущее время."
    "Часы показали 6:46, и поезд тут же тронулся."
    "..."
    "Я всё же успел."
    "Но мысль о том, что я мог не успеть из-за каких-то тридцати секунд, мне явно не нравилась."
    "Однако сейчас меня это почти не волновало."
    "Поезд давно уехал из знакомых мне мест."
    "В вагоне, в котором я сидел, так никто больше и не появился.."

    me " \"Опять еду в полном одиночестве...\" "

    "Сейчас тем, чем можно было любоваться из окна, были лишь бескрайние поля и редко встречающиеся леса."
    "Моя деревня была последней остановкой перед конечной - мегаполисом юга, с названием FYTLu#324."
    "Больше остановок на пути не будет..."
    "Именно туда мне приходится ездить на работу 5 раз в неделю."
    "Путь от моего дома к этим \"бетонным джунглям\" меряется не одной сотней километров."
    "Возможно, сто лет назад людям такие расстояния показались бы довольно большими, учитывая, что для их преодоления используется обычная электричка."
    "Но для теперешнего общества всё по-другому."
    "Может поезд, в котором я еду, внешне не выглядит как-то особенно..."
    "Однако он в состоянии поддерживать среднюю скорость, близкую к 400 км/ч."
    "И это далеко не предел."
    "Модель загородных электричек - LDET-334 - что совсем недавно начала выпускаться Межрегиональной Транспортной Организацией,
    непосредственно подчинённой Верховному Управлению CCv03,"
    "уже зарекомендовала себя как \"надежный и проверенный транспорт\"."
    "Первые тесты показывали, что новая модель способна разогнаться до 800 км/ч."
    "Недавно Правительство (Верховный Комитет), в целях безопасности, запретило перевозить на таких высоких скоростях, как и грузы, так и пассажиров."
    "Поэтому большинство рейсов теперь используют свою среднюю скорость движения..."
    "Вообще, система сверхпроводящих магнитов, установленная на железнодорожных путях, с помощью которой поезда в процессе движения не касаются поверхности рельс,"
    "была придумана очень давно."
    "Но лишь тридцать лет назад она достаточно развилась для того, чтобы её начали внедрять повсюду."
    "И достигла необходимой экономическо-выгодной фазы."
    "..."
    "А важно то, что практически все, живущие на обочине вселенной, теперь могут спокойно добираться туда, куда пожелают..."
    "И с достойным комфортом."
    "Все более-менее современные поезда движутся бесшумно и без намеков на покачивание."
    "В среднем, электричке требуется от двух с половиной до трёх с лишним часов времени, чтобы добраться до необходимого мне места назначения."
    "..."
    "Помимо LDET-334, есть ещё более продвинутые виды поездов, но это нужно уже смотреть на рейсы МежМегаполисного масштаба."
    "И конечно же, скорость перевозки там значительно выше, особенно в моделях VIP класса."
    "..."
    "Будущее..."
    "Каким его представляли люди много лет назад?"
    "Если бы ..."
    "нашелся такой человек, который его ещё не видел,"
    "чтобы он захотел нам сказать?.."
    "Лично для меня..."
    "Будущее давно наступило,"
    "но и близко не было таким, каким я его себе представлял."
    "Говоря про будущее - многое изменилось в этом мире,"
    "но было и чувство, будто всё откатилось назад."
    "..."
    "Да и что такое \"будущее\"?"
    "Мы не можем увидеть или почувствовать его."
    "Иногда мы можем его просчитать или предугадать."
    "Но всё равно будущее будет иллюзией, пока мы не осознаем, что оно стало настоящим..."
    "..."
    "..."
    "Каждый раз, когда я еду в FYTLu#324,"
    "я, прислоняя голову к окну, задумываюсь о событиях прошедших десятилетий..."

    jump prologue_train_nothing


label prologue_train_nothing:

    scene black with slowdissolve
    play music whales fadeout 3

    "..."
    "Больше нескольких веков назад во время мирового энергокризиса,"
    "когда казалось, что выхода из положения нет,"
    "учёные передовых стран нашли новый элемент глубоко в недрах земли."
    "Ранее неисследованный, поначалу он представлял из себя большую загадку."
    "Было много споров на тему его происхождения, а также событий, приведших его появлению на планете."
    "В итоге, большинство придержалось мнения, что элемент инопланетный."
    "В ходе исследования обнаружилось, что он, помещенный в специально созданную искусственную среду,"
    "способен выделять колоссальное количество энергии при минимальных затратах."
    "Элемент получил кодовое название XiJ. Была создана одноименная организация, целью которой было перестроить всю энергосистему мира."
    "Работа кипела, но очень нескоро был придуман способ его добычи, ведь тот обладал и множеством других скрытых свойств."
    "Но мир не мог ждать."
    "Началась новая война."

    jump prologue_burned_city


label prologue_burned_city:

    scene bg memories burned_city with slowdissolve

    "Она была не такой, как предполагали многие."
    "Война не уничтожила человечество, но имела серьёзные последствия."
    "Бесчисленное количество людей погибло, многие мелкие страны были стёрты с лица земли."
    "Дошло даже до сброса нескольких атомных бомб."
    "Под конец войны, когда пол планеты лежало в руинах, явились Они.."
    "Те, кто столетиями дёргали за ниточки."
    "Те, кто управлял ходом истории."
    "Об их существовании давно догадывались."
    "И называли их по-разному."
    "Но тогда уже было не важно, кто они."
    "Разорённый войной мир жаждал перерождения."
    "А они могли его дать."
    "Даже если бы им кто-нибудь помешал, они бы всё равно пришли к власти."
    "Ведь за ними стояли ещё сотни таких же, как они..."
    "Та элита, что тайно управляла миром, с того момента стала называть себя \"CC\" или \"Командный центр\"."
    "И только благодаря им, мир начал свой путь к восстановлению."
    "..."

    stop music fadeout 3

    # TODO: Сюжетная стена, которую автор собирался добавить позже
    # TODO: jump prologue_constructions
    jump prologue_after_burned_city


label prologue_after_burned_city:

    scene black with slowdissolve

    "Я повесил голову, уставился в пол вагона и закрыл глаза."

    play music november fadeout 3

    "Через какое-то время, я услышал знакомый голос утреннего ведущего новостей МежСетевого телевидения."
    "Сколько я себя помню,  этот человек всегда был одет в офисную форму, лица его было не разглядеть, так как оно всегда было размыто."
    "Я вскинул голову, посмотрел на дисплей в конце вагона..."

    me "\"Кажется, ничего нового...\""

    "Яркая надпись над дисплеем показывала текущее время - \"08:01\""
    "И, ровно по расписанию, на самом дисплее была изображена в точности персона, которую я описал ранее."
    "Казалось бы, что информация, полученная от такой сомнительной личности, не должна внушать доверия."
    "Но, судя по известному мне настроению общественности, к такой странной политике СС уже давно привыкли."
    "Поэтому, большинство спокойно воспринимает всё, что даст им руководство Сети..."
    "А самый интересный факт из всего этого - никому пока не удалось адекватно подвергнуть сомнению слова СС."
    "Лично меня мало когда интересовали новости социума."
    "Сколько бы я их не слушал, я не мог найти полезную для себя информацию."
    "Вся эта болтовня о политике, общественном порядке и т.д. никак не влияла на мою скромную жизнь, а значит,"
    "подобного рода информация была для меня бесполезной..."
    "Порой я даже удивляюсь, как я могу так спокойно жить на отшибе общества."
    "Всё бы так и продолжалось, не будь у меня доступа к unet (искусственный потомок интернета, созданный и распространенный Организацией всем жителям Сети)."
    "Где я могу проводить часами, читая только интересующую меня информацию..."
    "Фактически, СС контролирует весь юнет, но не вмешивается в дела обычных людей, пока те не придумают чего-нибудь противозаконного."
    "\"Тише воды, ниже травы\" - вот таким правилом нужно руководствоваться, чтобы не навлечь на себя лишние подозрения..."
    "Впрочем, я думаю, в этом плане мало что поменялось с тем, что было до войны, ведь люди не сильно изменились."
    "Но тот же даркнет никто не отменял."
    "Тем не менее, имея настолько хорошо организованную и функционирующую систему, как \"Сеть\", СС даже научились предотвращать преступления,"
    "и с легкостью разбираться с правонарушителями."
    "Больших успехов в этом направлении ещё не было, но руководство сделает всё, чтобы облегчить своё бремя управления..."
    "..."
    "Возвращаясь к прошлой теме..."
    "Не так давно всплыла новость, равнодушной к которой я остаться не мог..."
    "Несколько лет назад, во всех источниках СС была опубликована информация о том, что из глубин космоса приближаются невиданные доселе кометы."
    "Как заверяют исследовательские организации, целый кластер этих комет пройдёт на близком расстоянии от планеты, отчего можно будет наблюдать их феномальный пролёт невооруженным глазом."
    "К тому же, новостей по этой теме не было уже давно."
    "Сейчас телеведущий рассказывал как раз об этом."

    jump prologue_train_tv_speech


label prologue_train_tv_speech:

    scene bg train v2 hall with slowdissolve

    speaker "Сегодня поступило официальное подтверждение на разглашение информации от компании XiJ, и было объявлено о том, что подготовка к невиданному событию идёт полным ходом."
    speaker "По самым последним прогнозам, кластер комет под временным названием PYU-336 приблизится к планете всего через несколько месяцев."
    speaker "Исследователи до сих пор пытаются понять уникальную природу этого движущегося скопления и продолжают с интересом наблюдать за происходящим."
    speaker "По их словам, возможность наблюдения подобного события возникает по меньшей мере раз в тысячу лет."
    speaker "Также было упомянуто, что, вероятно, давным-давно нечто похожее могло наблюдаться, но не было зафиксировано ни одного случая."
    speaker "Они утверждают, что каждая из представленных комет в кластере имеет уникальную структуру, и это обусловлено тем, что каждая из них состоит из доселе неизвестного элемента."
    speaker "Известно только то, что этот элемент в составе структур меняет магнитные свойства и гравитационные силы носителя."
    speaker "А по следу, оставленному в пространстве, было обнаружено, что это скопление комет путешествует по галактике более тысячи световых лет."
    speaker "По предварительным данным, лишь малая часть попадёт в нашу систему."
    speaker "Ибо большая часть кластера или исчезнет по пути, оставив после себя газ и пыль, или будет притянута другими космическими объектами."

    "..."
    "Телеведущий всё продолжал..."
    "Я слушал внимательно, пытаясь запомнить самое важное."
    "Такого рода событие сложно себе представить."
    "Увидеть настоящий звездопад. Одна только мысль об этом заставляет меня трепетать."
    "Я всегда любил небо. Далекое небо, до которого я никогда не дотянусь."
    "Одна из моих мечт - заснуть под сиянием ночных звезд, тёплым летом в поле..."

    stop music fadeout 3

    "Для меня это было бы настоящим царством безмятежности."

    jump prologue_city_train_station
