
label prologue_office_after_cafe:

    scene bg office main_character workroom evening with slowdissolve

    "Оставшееся время я трудился в поте лица."
    "Работы было настолько много, что под конец я решил расслабиться, учитывая то, что сегодня я не успею всё закончить."
    "Я не чувствовал себя сильно уставшим, ибо в обед так знатно перевел дух, но мысли мои блуждали в тумане."
    "И если потом окажется, что я где-то напортачил или что-то просчитал, мне стоит ждать нагоняй, в худшем случае, от всего отдела..."

    jump prologue_office_choose_ending
